{
  "head": {
    "vars": [ "trope" , "comment" ]
  } ,
  "results": {
    "bindings": [
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/MrExposition" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "A character whose purpose is to provide Infodumps and explain the plot. Ostensibly, this is for the benefit of the protagonists, but most of the time their real reason for existing is to provide Exposition to the audience. This is why they spend so much time explaining things the protagonists already know. Popular in Science Is Bad stories, where you can bet the Mad Scientist in charge will have a tape recorder with him at all times that he's always dictating his progress to, Mr. Exposition is also an essential component of the Instructional Dialogue. In spite of the name, this is an equal-opportunity position, as the many female examples below demonstrate.\nThe Watson, especially if Constantly Curious, may force Mr. Exposition into this role.\nSee also Captain Obvious, Expositron 9000, Haunted House Historian. The Combat Commentator is a variation that provides color commentary for ongoing fights. Not to be confused with Ms. Fanservice, though the comparison could make for some interesting puns." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/TalkingToHimself" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "Professional voice actors pride themselves on range. So, hiring a few good voice actors means you can take care of many, many characters with a small cast (especially if one or two actors are a Man of a Thousand Voices).\nOftentimes, this results in funny situations, like two characters played by the same person having intense conversations and heated arguments with each other. The talent is in making sure the audience doesn't know it. If jokes are made about this, it's Actor Allusion.\nIn voice acting, the process is fairly simple, with the actor just doing a different take (although some good voice actors can do it in real-time). The actor's vocal range is the only thing that might betray commonality.\nThis is sometimes actually invoked on purpose, as it can make you think, \"Ohey, they're a clone? Why didn't I realize that before?\"\nIn Live-Action this can be difficult, which requires split screen or otherwise splitting the image. This requires perfect synchronization between the different takes. Normally, the camera is stationary for this, but Back to the Future Part II pioneered a motion controlled camera that allows for complex panning shots that have the same actor in multiple roles.\nNot to be confused with I Can't Use These Things Together, Sounding It Out, Thinking Out Loud or Talking to Themself. Compare Holding Both Sides of the Conversation, which is an in-universe example of this trope, where a character is pretending to hold a conversation with another non-present (or non-existent) character, in order to maintain some kind of charade." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/WarriorPrince" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "This is where a member of royalty actually takes part in battle himself, especially as commander. This was once quite common, and examples of it can be found from time to time in the present day. It is a favourite of epic and romantic tales. A warrior prince can be a Wise Prince, bravely fighting for his kingdom; he can also be an evil conqueror. While this character always stands a high chance of being a Bad Ass it is even more likely in that second case, as the Big Bad exposing himself requires a certain level of Badassery.\nVery, very common in myth and legend, going back to those Older Than Dirt.\nA subtrope of Royals Who Actually Do Something. See also Authority Equals Ass Kicking, Lady of War, and the Distaff Counterpart, Badass Princess.\nIn terms of the ranks of Authority Tropes, the tropes that are equal are The Evil Prince, Prince Charming, Prince Charmless, The Wise Prince, and all Princess Tropes.\nThe next steps down are The Caligula, The Good Chancellor, Standard Royal Court and Deadly Decadent Court. The next steps up are The Good King, God Save Us from the Queen!, The High Queen, and The Woman Wearing the Queenly Mask." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/AFatherToHisMen" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "This commander cares deeply about his men and exhibits it constantly. A mentor to the officers under him, he takes a deep personal interest in their welfare and tries to keep them out of harm's way. He would never say, \"We Have Reserves\" (unless it would save more lives in the long run- but expect him to be torn up about it, though he may hide it almost perfectly—and certainly never to make him look better). Staff officers, engineers, and the Camp Cook will be treated with respect and made to feel as valued as the troops on the front line, though he'll not put up with bureaucratic nonsense. He will never lay claim to work actually performed by his subordinates, and will try to pass the credit to where it's due if it is misattributed to him. He will accept responsibility for any mistakes, even if it was not entirely his fault, especially if the failure would result in severe punishment for a subordinate. He often follows up by treating his subordinate's mistakes as Career Building Blunders. And when his subordinates actually die, he will make sure to remember all of their names and faces.\nUsually a military mastermind who disdain wave attack carnages and instead will plan so that his faction will have the least casualties possible.\nStrategic or tactical blunders are usually the fault of those above him or below him. His career is often handicapped or cut tragically short by the incompetent High Command, his true worth appreciated only by the men he commanded. Or at least, that's the impression he projects to the troops.\nThis character generally cultivates a father-figure atmosphere. He is a source of morale, discipline and stability. Usually this is through a gentle reasoning tone, but sometimes he's a more strict (read harsh) father figure. In this instance expect a new soldier transferred to the unit to hate him, and for one of the older veterans to take him aside and tell a nice Pet the Dog story about the commanding officer. Sometimes all his soldiers are new; this will result in hatred until the soldiers either survive something that could have killed them, or accomplish a difficult objective, and realize that they would have died or failed without his strict training.\nHe is often utilized more as a device after he has left the scene, as an idealized counterbalance to the incompetent who succeeds him. This is probably because he's far more effective as a saint, and it'd be hard to maintain such an image when he's actually coordinating operations, especially cursed with Hollywood Tactics like he is. Indeed, an officer who learns You Are in Command Now may find his troops are Losing the Team Spirit over this commander's death—though he can issue a Rousing Speech reminding them that the dead commander would be So Proud of You if they soldier on.\nSometimes he's used to make the troops unhappy with their new commander, even if he is a good one- similar to the \"You're Not My Mother\" response given even to kind substitute authority figures.\nOther times he's a character who gets called in to deliver an Aesop after the soldiers mess up. Or he might be a mostly off screen character who gives the main characters a reason to try and do better, and to be embarrassed when they make a stupid mistake.\nWhen an enemy, he is often the Worthy Opponent or Friendly Enemy. If he's a subordinate, the Big Bad's lack of concern for his men may be a source of Mistreatment-Induced Betrayal.\nDespite the title and the use of a male pronoun, this trope is sometimes Gender Flipped.\nMost of the movie and TV examples in The Captain are of this type.\nSister Trope to Officer and a Gentleman, and they may overlap. If he is a Blue Blood, he will not care that his soldiers are commoners. This often surprises other Blue Blood officers.\nRelated to The Last DJ, Benevolent Boss. Compare Papa Wolf and the aforementioned Team Dad. See also The Patriarch and Reasonable Authority Figure.\nContrast Sergeant Rock who is also super-competent, but his leadership style is nasty; The Neidermeyer who is nasty and incompetent; Drill Sergeant Nasty who is either competent or incompetent as the plot directs. The opposite of We Have Reserves." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/IAmXSonOfY" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "Until the latter half of the 20th century, it was generally accepted that openly bearing your father's or culture's good name as a badge of honor was perfectly acceptable behavior, as it showed filial loyalty to one's roots. Not only was \"Son of Y\" basically your surname in ancient times, but Patronymic surnames are also where many modern last names come from (\"Jacobson,\" \"MacDonald,\" \"Alexeyev,\" \"Ivanovich,\" \"bin Tariq\" and \"González\", for example).\nThis is exceptionally true amongst Proud Warrior Race Guy societies in Real Life, such as the Samurai of Japan and the Knights of Europe, who by custom formally stated their names followed by father, clan and lineage out of respect for the foes before battling to the death.\nExpect any Proud Warrior Race Guy (or Gal) who enacts this trope to be The Stoic and admirably honorable person who is loyal to the traditions of his or her culture. They might even be the Heir to the Throne of said culture.\nAn increasingly common Variant B is a character who bears the name of his father and culture as a badge of pride, despite being an outcast from said culture. Bastards and children of (often wrongfully) dishonored parents are of this variant.\nNote that My Name Is Inigo Montoya is almost always crossed with this trope, as one would more often than not want the subject of his vengeance to quake in terror knowing just whom they have wronged and who is about to take their lives." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/LastOfHisKind" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "A character who is a species unto themself, the only survivor of some calamity that has wiped out their entire civilization. If this civilization used to be important in the power balance between civilizations that still remain, it's now considered missing.\nThis might mean that they're the last survivor of a particular society or secret order, but for full effect they are actually the last of an entire civilization, or even biological species.\nSuch a character is liable to manifest some profound Survivor Guilt, and the prospect of avenging their kind may develop into an obsession that acts as an Achilles' Heel. It will also provide an excuse for them to be substantially different (read: \"better\") in skill, abilities, or morality than the rest of the characters. However, the writers still need to be careful as to how they construct this Survivor Guilt: owing to Angst Dissonance, even something as traumatic as this can still degenerate into Wangst if the character seems determined not to get over it and eventually move on, or if the character's pain is written in an unconvincing fashion.\nWill often manifest qualities of the Warrior Poet or the Stranger in a Strange Land.\nSince this kind of loneliness is the sort of thing that could easily drive you mad, evil versions are about as common as good ones, particularly of the Nietzsche Wannabe strain. In general, being the last of one's kind is a polarizing experience: the only folks who tend to survive the death of their species are either the very best examples, or the very worst. The evil version will often carry a thematic notion that their very existence is an affront to the natural order, as they \"ought\" to have died with the rest of their kind, and it's rather rude of them to keep hanging on to life well past their time. Some really evil versions might even be responsible for the deaths of the rest of their race in a way (see Lobo below), as may The Atoner every once in a blue moon (see Tetrax, further below). In either case, if it was an engineered genocide, it just backfired.\nVery often, at least for the heroic sort, it will eventually be revealed that There Is Another.\nIt is fairly uncommon for such a character to be the lead character, even if they are an important member of the regular cast. Perhaps that level of isolation is just too much for the audience to really wrap their minds around — with most characters who are cut off from their own kind, there is at least the prospect of an eventual reunion. This character lacks even that prospect. However, a common Aesop (for the heroic ones at least) they learn is that, even if their race is gone, they aren't truly alone, having people with them who still love and care for them.\nCompare Fling a Light into the Future, Humanity's Wake, Uniqueness Value, and Living Relic. Genocide Backfire and Genocide from the Inside can both cause this trope. Endangered Species and Dying Race are not as extreme versions. Sometimes paired with The Aloner for truly horrifying angst. Occasionally Played for Drama or Played for Laughs with Only You Can Repopulate My Race. Occasionally the Last Of His Kind is of a previously extant Barbarian Tribe of some kind. If There Is Another, see Adam and Eve Plot. The Collector likely wants to put him in their Fantastic Nature Reserve.\nIf there was only ever one member of a species, see Single Specimen Species. Not to be confused with A Kind of One.\nNote that the very last of any species is called an endling.\nContrast with Monster Progenitor and The Chosen Many. Compare Racial Remnant. Overlaps with Single Specimen Species. If this is taking place in an After the End setting or such, don't be surprised if The Last Man Hears a Knock.\nSpoilers Ahoy!" }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/EveryoneCallsHimBarkeep" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "A Sub-Trope of No Name Given in which a character who is not just a \"victim\" of Only One Name, but is only known by his job title or an obscure or odd word that functions as an unusual nickname.\nDifferent from Only Known by Their Nickname, in that it is actually describing what they do. If the character initiates it, it's Spell My Name with a \"The\". May be the result of a Nameless Narrative. For parents, see Unnamed Parent. Compare with No Name Given. Related to They Call Him Sword. Compare/Contrast Race Name Basis when race is used for this and the character may or may not have a name.\nWhen it's not just a moniker but their actual name, it's a case of His Name Really Is Barkeep.\n\nExamples" }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/ManOfAThousandVoices" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "Voice Actors known for a wide range of voices, and therefore voicing Loads and Loads of Characters. Basically if you can't say \"Hey, It's That Voice!\", odds are, it was one of these people. Fact is, the industry is incredibly small, and there just aren't enough actors to cover all the exponentially increasing amount of characters and projects created each year. Being versatile is required.\nBonus points if the actor is able to avert Larynx Dissonance and Not Even Bothering with the Accent, but it's not vital.\nName comes from a nickname given to Mel Blanc, who was responsible for nearly every classic Looney Tunes character. (This is an exaggeration, however. He admits in his autobiography that he \"only\" did about 850 voices.)\nCan overlap with Talking to Himself, if the actor does multiple roles on the same show.\nInterestingly enough, the vast majority of voice actors and vocal work don't create \"voices\" but is largely using their own natural voice with slight tonal changes, pitched up or down. Thus it is still possible for a Pigeonholed Voice Actor to ironically also have \"a thousand voices,\" just people aren't aware of their versatility.\nNot to be confused with Voice Changeling or Voice of the Legion." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/WellDoneSonGuy" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "Our hero may be a perfectly Nice Guy, respectable, successful, a loving husband and a good father. But what he really wants is for this one guy to acknowledge this.\nMost often, that one guy is his emotionally distant father, though it can also be The Ace, The Obi-Wan, an Aloof Big Brother or especially that Always Someone Better individual, usually as an old friend of the hero. Almost always a Special Guest, and often a Large Ham as well. When it's a recurring character, usually a controlling parent.\nA Fawlty Towers Plot will often ensue as our hero tries increasingly more convoluted schemes to convince the \"Well Done, Son!\" Guy of his worth.\nIn the end, one of two things happens. Rarely, the \"Well Done, Son!\" Guy will turn out to have some kind of massive character flaw, and our hero will realize that it's been a mistake to weight his opinion so highly. This may result in the betrayed hero Calling the Old Man Out. Most of the time, though, everything comes to a head when the \"Well Done, Son\" Guy finally asks the hero why he's gone to such ridiculous ends. The hero fesses up, and the \"Well Done, Son!\" Guy explains that he's respected the hero all along, and assumed the hero already knew (You Didn't Ask). If the \"Well Done, Son!\" Guy is the hero's friend instead of his father, he'll often also explain that he'd always desperately wanted the respect of the hero as well (hell, sometimes the father wanted the kid's respect, especially if there's something big and nasty in his past, probably either ignored by or unknown to the hero).\nCue the Full House Music.\nIn other genres, this can be a bit more understated, with the \"Well Done, Son!\" Guy simply giving our hero an approving nod from a distance (or saying, \"That'll do, pig\"). If the \"Well Done, Son!\" Guy is a Trickster Mentor or Zen Survivor, they may have a very long and painful road ahead of them to get even that. May be part of an Inadequate Inheritor plot. The Fantasy-Forbidding Father usually inspires this sort of feeling. This dynamic is usually father-son. Mother-daughter and father-daughter are not too unusual, but mother-son is rare (unless it's the Jewish Mother scenario, which is almost always Played for Laughs).\nA really unpleasant variation is when the \"Well Done, Son!\" Guy is already dead, which in most cases means the approval and emotional bonding will never happen.\nContrast So Proud of You. Also see \"Well Done, Dad\" Guy which is the inversion of this trope.\n\nExamples" }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/AndCallHimGeorge" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "Aww, isn't this little guy cute? I'm gonna take him home and hug him and kiss him and squeeze him with all my heart and be such a great friend and...\n...and for some reason he fell asleep. You OK, little guy?\nLittle guy?\nSome monsters don't want to kill people; they just want to love them into iddy biddy pieces. No malice is intended, the monster just Does Not Know His Own Strength - but the \"pet\" is fully aware of the danger. Usually played for laughs, although there are exceptions. Possibly a deconstruction/satire of the Gentle Giant.\nThis trope, like Fluffy the Terrible, Grotesque Cute, Enfante Terrible, Killer Rabbit, and Psychopathic Manchild, plays off the conflict between \"cute\" and \"terrifying.\"\nIf the monster is a human, this may be the way they tame Fluffy. If not, it is a type of Non-Malicious Monster.\nSadly this is a bit of Truth in Television as children often kill small animals by accident in Real Life. This Trope is not to be be confused with naming conventions of Sleeping Car Porters." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/AlwaysMale" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "Much like roles that are Always Female, there is an enormity of roles largely (and frequently these roles are solely) designated to males. The name of the trope, however, is a bit of a misnomer, as some of these tropes can be subverted by making them female. In many cases, however, this doesn't work, especially for those involving love, sex or facial hair.\nIf a trope that's always male is applied to a female anyway, that's a Gender-Inverted Trope (a.k.a. \"rare female example\"). Again, this is not possible for many of these tropes, and is often done for comedic effect.\n\n\nRelated:\n Always Female\n Masculinity Tropes\n Princely Tropes\n Sir Index of Tropes" }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/HoistByHisOwnPetard" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "The villain's own weapon or malicious plan is the cause of his downfall and/or death. This could be something as big as a Mad Scientist who creates monsters and/or a Weapon of Mass Destruction getting killed by his own creation, or as small as a prankster accidentally setting off his own trap.\nIn media intended for young children, it is often a Death by Irony that releases the hero from the unpleasantness of actually killing their enemy; a more specific type of Self-Disposing Villain.\nIf the hero is not responsible for the death in any way, it can also be a Karmic Death.\nA \"petard\" is an explosive device (basically a bucket full of gunpowder) intended to demolish gates and fortified walls; being too close to the detonating explosive could well toss the engineers who planted it into the air. Thus, this term literally means \"Blown into the air by one's own bomb\" and was first coined by William Shakespeare in Hamlet.\nIf an Eldritch Abomination, God of Evil or otherwise supernatural evil entity gets Punched Out by the same powers it gave, you have a Faustian Rebellion in action. If it's an Ancient Conspiracy, Government Conspiracy or other organisation whose Applied Phlebotinum is empowering the one who will bring them down, you have a Phlebotinum Rebel. If it's a Mook, long abused, who finally snaps and turns against him at the last moment, it's The Dog Bites Back. If it's a Video Game boss whose attacks can be redirected back at them, it's Tactical Suicide Boss. Gone Horribly Right is a sub-trope where a Super Prototype works too well, destroying the person or persons who created it and/or threatening the world/galaxy/universe. If it's a vehicle that you just stole, it's Vehicular Turnabout.\nCompare Nice Job Fixing It, Villain and Beat Them at Their Own Game (a video game variation on this). The Streisand Effect is a subtrope of this, when the petard is censorship.\nAs this is often a Death Trope, all Spoilers will be unmarked ahead. Beware." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/IfYouKillHimYouWIllBeJustLikeHim" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "Very traditional line spoken as the hero has the villain in their power. It could be said by the hero, the former Distressed Damsel, or even the villain themselves if they're aware of the rules of the trope. The goal is to evoke a Not So Different moment.\nThe most common situation involves the villain hanging over a cliff or building, and the hero deciding whether to drop them or save them. Usually, this is a difficult choice for the hero because the villain is a Complete Monster or has done them great personal harm.  The villain will often attempt to pull the hero over the edge after the hero decides to let the villain live, resulting in the hero losing their grip and the villain getting a Karmic Death that isn't the fault of the hero.\nNote: this trope is not normally applied to a hero's attempt to directly preserve their own life, even if this involves deliberately killing Mooks.  This trope gets invoked when the villain either is or appears to be entirely at the hero's mercy.\nIn the most idealistic works, choosing not to kill the villain will lead to either a Karmic Death akin to the kind listed above or a reformed villain — possibly even Defeat Means Friendship.  In more cynical works, if the hero doesn't kill the villain, the villain will remain as villainous as ever and possibly even be a Karma Houdini, assuring room for sequels but leaving the hero in a moral grey area.   On occasion, the hero personally administers Cruel Mercy, which may in fact be ''worse'' than killing the villain. Or cooler.  Or both.\nContrast with Kill Him Already. Compare with Save The Villain and Sword Over Head. Anti Heroes are exempt from all four. Compare/Contrast Strike Me Down With All Of Your Hatred.\nThe Dog Bites Back and Disney Villain Death often go with this trope.\nSee If You Taunt Him You Will Be Just Like Him for when the stakes involved in this situation are lower. See also Jumping Off The Slippery Slope. A common Moral Dilemma." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/DramaQueen" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "I would just die of a shattered heart if you didn't Describe Drama Queen Here!\nCharacters who act dramatically a lot of the time, or at least when they have little reason to.\nWhether it's Fainting, hysterics, acting like they are in a second rate drama, or hyperbole to the point of bursting from it, the characters just live to be over-dramatic, even to the point of Chewing the Scenery and being a Large Ham. They also love Wangst and the tropes overlap.\nEven if not everything is a crisis, when it is a crisis, it is more important than anything else could possibly be. They could be in the hospital, but who cares about the guy with the broken leg? They have a hangnail!\nAlthough this is usually Played for Laughs, the term actually started as a nickname for Histrionic personality disorder. Yet over time, people would use the term, even about themselves, to describe people who were just being dramatic all the time.\nTeens, particularly teenage girls, are sometimes portrayed this way, often overlapping with Bratty Teenage Daughter. But this trope isn't exclusive to women. Guys can do this a lot as well, but this term is still used to describe them.\nA Sub-Trope of Melodrama, Chewing the Scenery.\nA Sister Trope to Attention Whore, Large Ham, The Prima Donna, Comical Overreacting.\nCompare It's All About Me, Sickly Neurotic Geek (who over-dramatizes things in other ways), Hair-Trigger Temper (who oozes anger instead of drama), Jewish Mother (who oozes guilt trips), Wangst.\nContrast The Stoic (who genuinely avoids drama), Stepford Smiler (who has plenty of reason to be dramatic but isn't).\n\nExamples" }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/DistaffCounterpart" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "One common method used in creating a Spin-Off is taking the main character of the show, creating an equivalent that's mostly the same except for being the opposite sex, and then packing the new character off to her own series. This allows the station or network to fill up extra space on the schedule with a known quantity, while (in theory) stretching its demographic to female viewers. This method is very popular among action-adventure series, which mostly appeal to young males. However, sometimes it can lead to a Counterpart Comparison situation.\nWhile heroes are usually the ones to get this kind of treatment, it's been happening more and more to villains too.\nThey're also the third kind of Spin-Off, with a long-lost sister showing up or a new girlfriend brought in, only to repeat whatever circumstances gave the main character his powers/duties/what-have-you.\nJust like how many female characters are defined by their relationship to the default or already established male character, many distaff counterparts are defined primarily by their relationship to the male counterpart. This can be shown through their visual properties, narrative connection, and occasionally promotional materials. They are often a wife or girlfriend, but can be a sister or friend to the male counterpart. Often, and especially if the characters in question are animals, the female character will have a bow on her head or other Tertiary Sexual Characteristic defining her as female and to set her apart from the \"default\" male characters. In other words, the male character or characters may have little or no stereotypical masculinizing gender specifiers, but his or their distaff counterpart or counterparts will have stereotypical feminizing gender specifiers to mark them as female. If the distaff counterpart is a girlfriend, she is usually the Love Interest to the male character.\nA male character who goes through the Gender Bender will find himself turned into his own Distaff Counterpart. The implications for the character, writers, and audience are left as an exercise for the reader.\nNOTE: \"Distaff\" means \"female\". Therefore, the inverse of this (a male counterpart to an existing female character or Always Female trope) is technically and traditionally a Spear Counterpart (which was named for the spearhead-shaped end of the symbol of Mars that represents males. You may also be thinking the \"spear\" meant something else).\nSECOND NOTE: A \"distaff\" is a spinning device, used with a spinning wheel and, even before that, with a spindle. More here. Textile Work Is Feminine; that's why it's used to symbolize femininity.\nUsually tends to wear a Gendered Outfit.\nCompare Gender Flip, which reverses roles based on gender, rather than cloning them. If a normally gender-specific trope is played on its opposite gender anyway, that's a Gender-Inverted Trope (otherwise known as a rare male/female example). If they're fan-created, it's Rule 63. If this appeals to a fan fetish, it's a form of Fanservice. When you take this trope to its literal conclusion, you get an Opposite-Sex Clone. See also Contrasting Sequel Main Character.\nThe laws of probability and large numbers will in all likelihood turn this into Truth in Television eventually for most of us." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/ThoseTwoGuys" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "Two characters, usually in a school setting, to be the mundane Greek Chorus. They may or may not be snarky and unlike the Greek Chorus, they don't break the fourth wall very often (if at all). They're completely ordinary... and no, we don't mean as in the Ordinary High-School Student, or the Badass Normal. They're ordinary. Often the best friends of the main character (who is an Ordinary High-School Student) before all the weirdness with aliens, robots, magic, demons, harems, etc.\nSome pairs become involved in the plot less and less as the series progresses, especially if the plot becomes more serious. Given what usually happens to people involved in the plot, it's probably for the best. However, it's not uncommon for Those Two Guys to also become popular and even iconic characters in the series.\nTheir personalities usually sharply contrast, e.g. calm/hyper, jock/geek, etc., or their appearances contrast, e.g. short/tall, thin/fat... When they don't, they will be exactly the same. They might even wear Coordinated Clothes. Their names are often esoteric (either too complex or too simple to stand out), plus their non-involvement with the plot usually results in them being called \"Those Two Guys\".\nOccasionally, we get a Lower Deck Episode from their point of view. Expect to ask someone Who Is This Guy Again? after a few episodes.\nCompare the Beta Couple, Heterosexual Life-Partners, Tomboy and Girly Girl, Sensitive Guy and Manly Man, Straight Man and Wise Guy, Statler and Waldorf and The Dividual. This trope may sometimes overlap with Red Oni, Blue Oni trope (though that trope isn't always exclusive to the Those Two Guys trope). Despite the similar name, Those Two Bad Guys have very different personalities from Those Two Guys... even if they are bad guys. If there's only one of these guys in a romance-based series, he's likely a Bromantic Foil. Also associated to members of a musical group who are not the Face of the Band." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/AscendedFanboy" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "Some fans are a cut above the regular otaku. For most, it is as simple as being hired to work in the industry that deals with the media you love, but in fiction, it can take a whole new meaning. The Ascended Fanboy is that lucky one-in-a-million with a hobby based on something imaginary which does not stay imaginary—it turns into reality, and he becomes a part of it himself.\nA variation is where it is imaginary to us but not in the context of the world, such as a mecha fan, in a world full of mecha, getting to pilot one.\nFor those lucky few, they receive the Call to Adventure, and ask: \"How high?\" Naturally, it is never so easy or glamorous as they thought it would be, but they've got the right stuff, and a whole lot of Beginner's Luck to last them until it comes out. As a side effect, they're usually Genre Savvy, sometimes to the point of excess. Of course you know, he could be wrong.\nOften a former The Team Wannabe. Subtrope of Audience Surrogate. Compare Promoted Fanboy, The Knights Who Say Squee. Contrast with Loony Fan. See also I Know Mortal Kombat, which often results in this.\nNote: This trope is for in-universe examples. For the Real Life counterpart, see Promoted Fanboy.\nThis has nothing to do with that kind of ascension, at least unless the fan really likes Daniel Jackson." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/WeCanRebuildHim" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "A villain is defeated and suffers a horrific Disney Death. Their body is shattered beyond repair. No One Could Survive That!\nBut later, he returns! Only this time, he's a cyborg! He's got more power, and he's less human so it's OK to be more brutal on him.\nHeroes are occasionally subject to this trope. Unlike villains, this tends to make them question their humanity, and in doing so retain it.\nThis trope can serve as the Origin Story for both heroes and villains of the cybernetic variety.\nA Subtrope of Emergency Transformation. Compare with Robot Me and Virtual Ghost. The fantasy counterpart is Came Back Strong. If the cybernetics are obvious and enhance the evilness of a character's appearance, it's a case of Red Right Hand. When the one doing the rebuilding is sadistic enough, it may involve Vader Breath. If the injuries are too extensive or the technology not far enough advanced, may result in Man in the Machine. A nasty variant is when a bad guy takes a Not Quite Dead hero and has him Reforged into a Minion." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/LetsYouAndHimFight" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "A pair of heroes who are strangers are Working the Same Case, often from widely divergent angles. When their investigations simultaneously lead them to the bad guys' lair, they stumble over each other and into a fight born of their mutual assumption that the other guy is one of the villains they're hunting.\nSometimes the Big Bad knows they're both coming and manipulates them into this situation in the hopes that they will weaken or eliminate each other — or at least distract both of them long enough for the bad guys to escape. One classic tactic used in this variation is a bogus order to one of the heroes to kill the other, bellowed over a loudspeaker. Another is convincing one or both heroes ahead of time that the other either is a villain or has done something horrible.\nThis trope is particularly overused in Super Hero comics and the movies and shows spawned from them. In that genre, it long ago reached the point of cliche and Lampshade Hanging, and even Genre Blindness no longer allows it.\nThen again, Buffy has breathed some new life into it by not letting the viewers in on the situation until she finds out.\nA lesser-used variant has a Big Bad manipulating lesser villains into fighting the good guys for him, or even into fighting other baddies. A Guile Hero or another so skilled might also pull this on his enemies, either to enact a getaway or distract them long enough to set up a sneak attack.\nAlso commonly known in comics fandoms as \"Fight Then Team Up,\" or the \"Marvel Misunderstanding\" (even in the Marvel Bullpen!)\nThe phrase probably first comes from the 1930s Popeye comic strip as a catchphrase of Wimpy, who often gets Popeye to fight big tough guys he's wronged - thus becoming a Got Volunteered situation. \"Let's You and Him Fight\" is also the title of a Fleischer Studios Popeye short revolving around a boxing match between Popeye and Bluto. It also appears in Eric Berne's 1964 book Games People Play as one of the identified behavior patterns used to manipulate others.\nSometimes occurs - particularly in a Cross Over - in order to tease fans with the possibility of an Ultimate Showdown of Ultimate Destiny. Of course, it almost always ends inconclusively. This is usually because Popularity Power evens the field when heroes are really mismatched in their weight class.\nSometimes leads to a Lighthearted Rematch. See also Why Isn't It Attacking? Comparable to We Are Struggling Together.\nHappens constantly with Headbutting Heroes. Contrast Fire-Forged Friends, Defeat Means Friendship, and Fighting Your Friend.\nWhen the two characters belong to different companies or shows, it's an Ultimate Showdown of Ultimate Destiny.\n\nExamples" }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/ThisIsSomethingHesGotToDoHimself" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "Everything comes down to a one-on-one fight between the hero and whoever has been his worst antagonist in the current plot. The hero's friends and reinforcements show up in time to intervene and give the hero a decisive victory with their overwhelming numbers and/or firepower, but they don't — or the hero won't let them — because \"This is something he's got to do himself.\"\nThis tactic might be a way to counter the ill effects of the Conservation of Ninjutsu...\nNotable examples can be found in almost every Western.\nThis is the logical extension of It's Personal, the cousin of Leave Him to Me, and often stems from Honor Before Reason. Also see I Work Alone for denying help from the beginning. There's also Locked Out of the Fight, where the hero does want help but circumstances contrive to prevent the helpers from helping. Compare Shoo Out the Clowns. Contrast In the End, You Are on Your Own, where the helpers can't be of any help even if they wanted to. See also What You Are in the Dark. Also contrast Figure It Out Yourself, where the bystanders could help, but don't, even if you ask, as well as I Can't Do This by Myself.\nContrast Helping Would Be Killstealing, for when it's a matter of experience and personal growth rather than honor or revenge." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/TheBigGuy" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "The powerhouse of the Five-Man Band. They are usually incredibly and unflinchingly loyal, and often they are the largest member and even more effective in combat than anyone else. (Sometimes combined.) They will often be the point man, they cause a disturbance and hold off the mooks while the others challenge the Big Bad. Of course, against stronger enemies they might end up suffering The Worf Effect; getting trounced to set up the villain as a credible threat.\nUsually what holds them back from leadership is being Dumb Muscle, they know how to knock heads together but don't do much in the way of strategy. While The Leader and The Lancer fight side-by-side, The Big Guy is a One-Man Army.\nNote: The Big Guy may not necessarily be the strongest in the team. They just have to be the one who, out of most duties, specializes in physical fighting.\nThe Big Guy on the Five-Man Band can be subdivided into five classes:\n Class 1: The gruff, mean, scarred and withdrawn warrior. Could go so far as to be a Berserker, particularly of the Death Seeker variety. In an entire Five-Man Band of ass-kickers, their big guy is most likely be a class 1, ready to punch you in the face for smiling at him.\n Class 2: The Gentle Giant who you don't want to push too far. Often when the other members are younger, he will be older and outside of battle is the calming element in the group, offering both experience and wisdom, or just able to pull two others apart easily.\n Class 3: The kind that looks like the first but is secretly the second.\n Class 4: The Boisterous Bruiser, whose presence is larger than his physical size. Often a Berserker of the Blood Knight variety, or an Emotional Bruiser.\n Class 5: A Genius Bruiser who can also fill the role of The Smart Guy. This character is rare, (presumably also for balance reasons) as The Smart Guy is traditionally unimposing and the Non-Action Guy. This version uses their muscle intelligently, the polar opposite of the Dumb Muscle. Occasionally overlaps with Robot Buddy.\nPowers and skills common to the big guy are:\n The Big Guy will often be the band's \"tank\" or Stone Wall; a Mighty Glacier who serves as the strongest physical fighter, but also the slowest and least proficient at magic. Alternatively, he's just a Stone Wall. The lucky ones are those who are as fast they are strong.\n Most Big Guys tend to prefer big, heavy weapons like axes or hammers (or oversized guns like bazookas or chainguns if in a modern/futuristic setting).\n Others are powerful martial artists who clobber the bad guys with their bare hands.\n If it's a magical setting, they may also be adept at Dishing Out Dirt or have a Green Thumb, as the \"earth\" element can be seen as tough, strong, and/or sturdy. Alternatively Ice may have similar connotations.\nThis bandmate is rarely a woman, unless the whole team is women. The Big Girl can be classified into three subspecies:\n The Cute Bruiser: she who packs a surprising amount of punch. Traditionally a little girl, but can be stretched to any woman who is not obviously of amazonian stature. May be a martial artist or some other form of athlete. In cases of truly great strength, she may be a cyborg, Robot Girl, mutant, alien, possess Charles Atlas Superpower, or have some other justification for unusual power. Usually just as cute and/or pretty as more typical female characters. Male versions of the cute bruiser exist too.\n Alternatively and more unusually, she's a Giantess, and thus plainly strong. She's rarely masculine but rarely conventionally attractive. (There's also nothing stopping her from being a robot, mutant, alien, etc. It's just that the surprise is gone.)\n Somewhat more rare is the Amazon: She's big, she's strong, she's muscular, and drooled over by men. (Sometimes Even the Girls Want Her). On the romance level, she often either is admired AND feared because of her strength or only be willing to yield to a really powerful male who is able to beat her in battle.\nWhen there are Two Girls to a Team, the Big Girl and The Chick commonly form a Tomboy and Girly Girl pair. Most of the time, the Big Girl is the tomboy and the Chick is the girly girl. However, there is nothing preventing the Big Girl from being more of a Girly Bruiser or Lady of War, or a tomboy from being The Heart of the team.\nAn exuberant Big Girl is either a Boisterous Bruiser or Genki Girl. If she's instead a Jerk with a Heart of Gold, her softer side is often a secret cache of feminine traits or one particularly girlish habit, which may make her embarrassed when found out. On rare occasions, she may be revealed to be a Butch Lesbian, a Tsundere, or even a Violently Protective Girlfriend.\nBesides gender, the most common way to subvert the trope is when the Big Guy is actually physically short, slim, or unimposing - and yet his strength comes with raw determination or intensity. (Or possibly supernatural means)\nThe Five-Bad Band's Evil Counterpart is The Brute. Not to be confused with that other Big Guy.\nCan have some overlap with Scary Black Man and the Proud Warrior Race Guy. Often a victim of Big Guy Fatality Syndrome." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/LeaveHimToMe" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "The villain is furious. The Hero and his allies have defeated his elite force and stolen his MacGuffin. In grand Evil Overlord fashion, he stands up and orders every man he has to attack the hero's entourage. But as for The Hero himself: \"Leave him to me!\"/\"He's mine!\" Unless the villain is sufficiently Badass enough to be a good match for the hero one-on-one, this is generally never a good idea.\nThe tendency of villains to order the hero captured alive or ignored on the battlefield so that they can have the satisfaction of killing him themselves, the result of It's Personal, and the evil version of This Is Something He's Got to Do Himself, almost always backfires. Considering that the villain's form of killing the hero is to put him in an easily escapable Deathtrap, maybe the Mooks should disregard the order...\nContrast The Rest Shall Pass which is the heroic version of this trope. If the hero and villain are on speaking terms, this can manifest itself as The Only One Allowed to Defeat You.\nSaying this is forbidden by rule 117 on the Evil Overlord List, and performing the action commonly associated with it is prohibited by rule 39. Villains who wish their Evil Plan to succeed are well advised to follow both rules.\nMore formally, you have Combat by Champion.\n\nExamples" }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/NiceGuy" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "The Nice Guy (or Girl) is nice. Maybe not a saint, but definitely not unpleasant, obnoxious or edgy rebel. They're friendly, psychologically well-balanced, morally average (if not better) and in short, someone anyone wouldn't mind to be around and have as a friend, which is often what they are to the hero and/or his extended cast. He won't engage in jerk-like behavior, but probably responds in kind to Vitriolic Best Buds.\nWant to know what writers think of that? \"Boring!\". This is because they can be conflict null zones romantically and dramatically because of a perceived (or real) lack of depth. Along with the Happily Married couple, the Nice Guy is among fiction's \"favorite\" Friendly Targets. They'll die senselessly to motivate their hero buddy, lose the girl to the more dynamic but unstable Dogged Nice Guy or just in general go through constant torment from the world around them.\nOn the other hand, if done right, it can demonstrate why a guy has beautiful women attached to him: he really is a remarkably wonderful and compassionate person. The Nice Guy can be engaging, likable or The Protagonist; all it takes is giving them a personality outside of \"nice\" such as: a scholarly refinement, a chivalric attitude, some engaging relationships, and a pinch of Hidden Depths.\nNor does it mean being nice means they're not tough, or an Iron Woobie. If combat intellect or combat ability are involved, it's akin to Obfuscating Stupidity or Crouching Moron, Hidden Badass because you naturally expect the dark, tormented loner to be rough and tough, and the nice guy to be a Non-Action Guy. So when it comes time for \"No more Mr. Nice Guy\", heads roll. On the other hand, with the All of the Other Reindeer trope in play, the nice fellow can be a redeeming factor as a person whom the beleaguered hero realizes is on his side and lets him know he's not alone. Unless the nice guy is the beleaguered hero, then he's screwed.\nOften, authors go the abbreviated route and give them a Dark and Troubled Past triggered by a Berserk Button. Either way, you can expect their niceness to be in spite of whatever tragedy or drama is in their lives; kind of an equal and opposite reaction to it. If done too suddenly, it implies a level of secrecy and acting that a Stepford Smiler would be jealous of. When done well, a more troubled character will rebuff their advice or friendship with \"What do you know? You've never had X happen to you!\" to his \"I did\", thus revealing healed-over scars.\nNote: this trope is referring to genuine Nice Guys, not the other sort of \"Nice Guy\" (aka the Dogged Nice Guy), which is more of a Bastard in Sheep's Clothing (usually with major Casanova Wannabe tendencies). Entitled to Have You is the trope for that concept. Also, if the Nice Guy has a rougher male as his Foil, they're a Noble Male, Roguish Male or Sensitive Guy and Manly Man duo.\nOccasionally, however, the treatment go the other way around: Perhaps in a world set upon Black and Grey Morality, and Gray and Grey Morality, this Nice Guy actually stands out because he IS a Nice Guy, he doesn't have the excuse to be cynical or mean, nor does he need to have a tragic backstory. He's that nice, friendly and helpful... that he eventually becomes a fan-favorite due to how much he stands out amongst the more cynical cast members, a refreshing breeze to say.\nIf he does get the girl, it's Single Woman Seeks Good Man. Usually, the result of Upbringing Makes the Hero. You should beware this nice guy should you press his Berserk Button. Exact oppositions of this trope are: Jerkass, Lack of Empathy, Jerk with a Heart of Jerk and the Complete Monster (extreme opposition)." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/AlwaysFemale" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "An index of characters that are female at least 90% of the time. Or at least female-identifed. For example, a male Wholesome Crossdresser, or a Gender Bender living in a female role can also fill these roles.\nFor the other 10%, see Gender-Inverted Trope (aka. a \"rare male example\")." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/ShesGotLegs" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "There are many things about a woman that can catch the camera's eye. Some shows may focus on her ample chest; others, her curvy behind; and others still like to take a really long look at how lovely her legs are.\nThis trope deals with cases where a female character's legs are given special attention. This is in the form of Male Gaze, usually with slow pans up her legs, or her legs are mentioned at some point in the story as being an attractive feature. This is notably recurrent in G-rated fiction, where the Male Gaze is directed to the legs rather than the even more sexualized breasts and buttocks.\nOften seen in conjunction with a Sexy Walk. Zettai Ryouiki, Showgirl Skirt, Dangerously Short Skirt, Underwear/Leotards/Mini Dresses Of Power, Qipao, Who Wears Short Shorts? and Footsie Under the Table are also good ways to show off these features. A Kick Chick will almost always have these, as will most female Dance Battlers. The Statuesque Stunner will also have these, more often than not. Bath Kick and Foot Popping are used to show these off as well. If the Amazonian Beauty has them, expect either the narration, other characters, or the character design to emphasize her legs' muscularity as attractive, often with special attention to the thighs.\nRelated to Fanservice, natch. Show Some Leg is not necessarily related, but certainly can be." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/CainAndAbel" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "Sometimes Sibling Rivalry can get a little... intense. Maybe one who Missed the Call gets overly jealous that the other has become The Chosen One, maybe grand powers or knighthood run in the family and one just happens to have been tempted to The Dark Side, maybe one of them betrayed their master or father and the other has to stop him, or maybe it's just Because Destiny Says So, dammit. Whatever the case may be, now one's the hero and one's the villain, and they must do battle. Commence the angst.\nFor whatever reason, the older sibling is almost always the villainous one. Probably because being younger and less experienced makes the younger sibling the underdog, whom we are supposed to root for. And because the Aloof Big Brother always looks eviler. The major exception is the case of The Evil Prince, who is usually the younger of two princes, and who will do anything to make sure he succeeds their father instead of his brother (or in the case of the prince being the king's brother, to take the throne for himself directly).\nIt's not always siblings — Childhood Friends get to experience all the same woes from beating up someone they grew up with — but there's a certain poetry when they're actually related. Note that they are traditionally always of the same sex: brothers or sisters (though there are notable exceptions).\nIn cases of where the Cain turns out to be The Unfavourite, he's likely to be viewed from a more sympathetic angle. Of course, this would partially also depend on the sibling's attitude in all this. Sometimes the siblings will become The Only One Allowed to Defeat You, or realize they're Not So Different. If the hero isn't aware of the relation until late in the series, it's also a Luke, I Am Your Father. We Used to Be Friends and Evil Former Friend also counts if the siblings in question were former friends with each other. Compare Oedipus Complex. Contrast Sibling Team. Also contrast Bash Brothers, where the two people (who may or may not be brothers) beat up other people instead of each other. When Cain is gunning for mom and dad instead of Abel see Antagonistic Offspring.\nThe trope title, of course, comes from the biblical story of the first siblings to exist. See also Name of Cain. When There Is Another, compare Cain and Abel and Seth. If not a Good vs. Evil situation, see Sibling Rivalry.\n\nExamples" }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/WhenSheSmiles" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "So there is this one character who never smiles. They are always so serious. Or maybe they're an The Eeyore who always sees the worst of things. Then one day they smile, and there is something about the sheer happiness in that smile that makes whoever is watching immediately feel welcome, or better, and very often want to make them smile again. Preferably a lot. Depending on the application, can lead to Love at First Sight, a Love Epiphany, or a heartwarming moment.\nIn summary the requirements for this trope are:\n1: Character that rarely smiles (Emotionless Girl, Deadpan Snarker, Broken Bird, The Stoic, etc)\n2: This character smiles\n3: This smile is perceived as beautiful\n4: Other people experience an increase in their affection for this character\nOn rare occasions this can be played with a character who typically shows an insincere smile (such as a Stepford Smiler or a Smug Smiler) who then has a sincere smile.\nIt's not actually Always Female; the title comes from the song \"Absolutely (Story of a Girl)\". Go Out with a Smile often involves this plus Tearjerker. A shy cousin to What Beautiful Eyes, and Unkempt Beauty; a subtrope of OOC Is Serious Business. Contrast with The Unsmile, where the smile is just plain unnatural.\nIn-Universe examples only, please. Do not include Audience Reactions." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/ApocalypseMaiden" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "In most stories, the Big Bad is the one who wants to bring about The End of the World as We Know It with anything from an Earth-Shattering Kaboom to a demonic invasion. Usually it's because they will become The Antichrist and are prophesied to destroy the world.\nYou can understand why The Hero will get very confused when he finds out it's actually their Love Interest, their younger or older sister, his childhood friend (either Unlucky Childhood Friend, Victorious Childhood Friend, or Forgotten Childhood Friend) or another member of the Five-Man Band (most likely The Lancer or The Chick) who is The Chosen One fated to destroy the world. The reasons vary, maybe they have inherited a form of Enemy Within capable of a truly Unstoppable Rage that can destroy worlds, or have been possessed by an Eldritch Abomination, or most heart wrenchingly they are completely innocent yet their mere existence acts as a Butterfly of Doom that can destroy the Cosmic Keystone. Either way, they're going to somehow bring about the apocalypse in some form Because Destiny Says So.\nNeedless to say, the villains (and certain heroes) who realize this want to nip this in the bud by killing said Chosen One. Of course, seeing as that person is one of their True Companions (usually a Love Interest), the heroes say Screw Destiny and try to protect the chosen one from others and potentially, even themselves. Then again, some villains (and certain heroes) may well want them to destroy the world, and kidnap them in order to brainwash or sacrifice them in a manner that kick starts the apocalypse. In which case the heroes have to find a way to stop the world ending and save their friend... and both may be mutually exclusive.\nSadly, because You Can't Fight Fate these attempts to prevent the cataclysm may become self-fulfilling because Prophecies Are Always Right (in such a case, its a Downer Ending). Optimistically, their friend's efforts and The Power Of Trust may embolden them to become an Anti Anti Christ and successfully rebel against their destiny... even if it requires the ultimate sacrifice.\nProphetic Fallacy may also be a cause for the villain's alarm, or maybe The Powers That Be were merciful.\nThis is more of a plot than a character (it could be either). Much like Barrier Maiden, this trope is open to both genders. See also/contrast Big Bad Friend, Save This Person, Save the World and Barrier Maidennote (which is basically the inversion of this; the Barrier Maiden's purpose is to sustain the world while the Apocalypse Maiden's purpose is to destroy it). May well become an Anti Anti Christ.\nSubtrope of the MacGuffin Girl." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/SheIsNotMyGirlfriend" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "Yes, she is. If she isn't, she eventually will be. Resistance Is Futile. Narrative Causality compels you.\nA standard response in the face of an accusation that two characters are more than Just Friends. Usually said with an exclamation point - or ten - at the end, and emphasis on the \"NOT\", maybe accompanied by breaking something.\n\"He is not my boyfriend!\" is another version, albeit not as common, probably in a 65/35% ratio. There are also instances when the two accused say it simultaneously.\nIs it true? Technically, yes. Hilarity, if not bloodshed, ensues, because:\n Nobody believes them anyway.\n The speaker and subject are long overdue for a Relationship Upgrade.\n The subject was under the opposite impression.\nA common inversion, especially in the second case, is when the speaker is asked about the not girlfriend/boyfriend in question, and they respond with the line, even though the accusation was never brought up in the first place. Alternately, the accusation is made, but not the name, which the defendant then gives up. In either case, cue satisfied smirk by the asker.\nThe amount of exclamation marks and how much the characters protest and try to convince people that they aren't together is usually proportionate to the amount of Unresolved Sexual Tension between the characters in question. Presumably characters who really aren't wouldn't feel threaten by the accusation.\nEspecially common in shows and on channels (\"Teen\" Nick goes crazy with this) where kids and/or preteens are the main audience. Quite interesting, as more often than not, most kids aren't ready for that kinda stuff yet, and therefore could use whatever interpretation comes their way. For some, the trope can be coupled with the fact that it allows for both a male and female protagonist in starring roles (thus reaching a wider audience) but is as far as the either the Media Watch Dogs or writers will ever go in terms of illustrating romance and relationships in a series.\nSee also Relative Error, for when the pair involved are relatives of each other, and Mistaken For Romance.\nOne of the stock phrases for Tsunderes (both genders), or one/both of a couple who are Just Friends.\nThis does not result in The Not-Love Interest.\nCompare/contrast with Stupid Sexy Friend, wherein deciding they should just be friends is contrasted with the thoughts of being more than friends one can't get rid of." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/JustEatHim" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "The nature of predator and prey is often made more complicated than it needs to be. Especially when the prey just happens to be the protagonist.\nFor instance, if the predator seeks to kill his enemy or turn it into food, one would think that the process would be fairly simple. Just have it catch the prey in its mouth, chew its flesh and/or bones into a nonliving paste, and swallow it.\nIf the character is fodder for the Monster of the Week or a horror antagonist, this doesn't happen. One of the following two outcomes almost always ensues:" }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/NotHimself" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "A close relative of Evil Twin and \"Freaky Friday\" Flip, Not Himself is any plot where a character acts contrary to the way they normally behave. Can be used to provide a mystery to be solved, or to incite bewilderment in the other characters. The deviation is often a marked increase in evil, insanity, and/or horniness: the emergence of the inner shadow — or a switcheroo.\nSometimes, it's a detective or police character behaving as if they were corrupt, or a criminal. This will usually turn out to be the Fake Defector.\nIf the change is deliberate to save their friends, it's an Out-of-Character Alert.\nIf the change is caused by poor writing or is never given an in-canon reason, this could be Character Derailment.\nCompare Out-of-Character Moment and Weirder Than Usual. Contrast with Something Only They Would Say. See also Virus Victim Symptoms.\n\nExamples" }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/WhyDontYouJustShootHim" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "Villains frequently find themselves in conundrums that could easily be solved by finding the right person and shooting them but refrain from doing so.\nThere may or may not be some in-story justification for this failure to take the direct approach. The Doylist explanation will always boil down to the fact that if he did just shoot him, then the story would be much shorter and would end with the bad guys winning." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/OffWithHisHead" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "If you're dealing with any sword-oriented media, whether it be fantasy, medieval, kung fu, or something else, and it's more violent than a PG-13 rating, chances are, someone is going to get his head chopped off (and it may not even need the R rating if you're dealing with nonhuman enemies). One of the most common methods of execution back in the medieval era next to hanging, decapitation is usually one of the surest ways to ensure someone is Deader than Dead barring some very potent magic or divine intervention. Indeed, in Real Life, it is one of the very few ways that death can be instantly diagnosed.\nAny Ridiculously Human Robot (even one with a Cranial Processing Unit) or other decidedly inhuman being will probably be capable of surviving decapitation, and will do so at some point either for a joke or as a plot point. In less serious series, the body will even continue to walk around bumping into things.\nIt is nearly always depicted as being surprisingly easy to do, even in one blow to a moving target. While Anne Boleyn did get beheaded with one stroke, most pre-guillotine beheadings took at least three strokes (plus, Boleyn's executioner was — by request — a professional swordsman who would know how to cleanly behead someone). In an actual Sword Fight a strike on the head was much more common, since it didn't put your sword at a very awkward angle and required much less force.\nThis trope is named after the line Off with his head; — so much for Buckingham from Colley Cibber's adaptation of Richard III. The trope was also famously used by the Queen of Hearts in Lewis Carroll's Alice in Wonderland. See also Your Head A Splode for a much gorier version of this trope and Boom, Headshot when it comes to firearms.\nAlso see Alas, Poor Yorick, Decapitation Presentation and Severed Head Sports. When cutting of the head is the only way to kill something, it's Decapitation Required. If the decapitated head is somehow still alive after the fact for any notable length of time, that's Losing Your Head.\nAs per being a death trope, EXPECT UNMARKED SPOILERS!!!" }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/TeachHimAnger" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "Kindness is a highly valuable trait in people, but, if taken to extremes, also a potentially dangerous one to have. In episodes where the Nice Guy and Friend to All Living Things will unavoidably have to face danger, friends will try to teach them assertiveness, a few self defense moves, or actual fighting techniques to face threats. The problem lies in that they are too timid, half hearted, Weak-Willed or kind to avoid their Extreme Doormat tendencies, much less actually learn to fight.\nThe solution is to teach him or her anger and rage; rather than dealing with their anger in a healthy way (or more likely, sublimating it) instead channel it into their words and fists. In extreme cases, even going so far as to instill a killer instinct.\nThis can have two outcomes, one good and one bad.\nThe good outcome results in the character taking a level in badass and gaining a backbone along with the combat skills thanks to this training, which may take the form of anything from simple self defense classes to outright maddening them into misanthropy. Their nature and demeanor as a kind/caring/friendly person will otherwise remain unchanged, but now they'll stand up for themselves and the weak rather than simply caring for them.\nThe bad outcome happens when they learn anger only too well. In some cases, these kind and caring pacifists subconsciously knew they were carefully balanced over a dormant volcano of potential violence and chose to keep it dormant at all costs. And then their friends went and woke it up. If Phlebotinum is involved then it is likely paired with An Aesop against changing others to suit you...because they'll turn into Brainwashed and Crazy dynamos of destruction who revel in their new Superpowered Evil Side. There may be a cry of \"What Have I Become?\"/\"What Have I Done\" if someone they care for is hurt, or killed!\nOn the bright side, these usually end in Pygmalion Snapback.\nCompare Did You Think I Can't Feel?, Killing Intent, Rage Breaking Point.\nContrast We Want Our Jerk Back and Tame His Anger. This may be applied to large groups in the form of Training the Peaceful Villagers." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/MacGuffinGirl" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "The plot where the object that everyone is looking for turns out to have been transformed into a girl (with the occasional variation of being a Robot Girl). It's usually (but not always) a girl, and is usually associated with several of the following tropes or plot elements:" }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/GrandmaWhatMassiveHotnessYouHave" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "For most people, their looks fade somewhat as they get older, being only appreciated by their long-term loves.\nHowever, there are exceptions to every rule. Sometimes, Grandma or Grandpa (despite the name, this trope applies to either gender) ages like wine. For fangirls in particular, there's just something about older men... Their starting age is generally around 50, but they do not actually need to be a grandparent (as demonstrated by the woman opposite, who not only isn't a grandparent but isn't even a parent).\nDoes not count for immortal or ageless characters.\nCompare Stacy's Mom, with which this can overlap. Also likely to overlap with Silver Fox.\nContrast with I Was Quite a Looker. See also Christmas Cake, and Likes Older Women. When adding examples, avoid people who are Hollywood Old. They must be visibly old for the trope to be in effect.\nDo not confuse with Older than They Look, or its extreme counterpart, Really 700 Years Old, unless they look old to a normal person despite being far older than that would imply on its own. See also Grande Dame. For elderly female characters who are more noted for concupiscence than attractiveness, see Dirty Old Woman.\nAs the photo of Helen Mirren at right illustrates, Truth in Television can apply (other often-cited real world examples include Sophia Loren and Joan Collins). However, examples listed below should be confined to fictional references, as attempting to identify too many real world examples might slip into YMMV territory." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/BringHimToMe" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "A Big Bad brings the captured heroes to his/her lair — and frequently the very heart of it. For bonus points, sending all the guards away so he can talk to the hero in private.\nYeah, this is always a smart idea. Bring your enemy deep into the control center of your base, and dismiss the guards. There's no way he can mess things up from there...\nAny simpler solution seems to be out of the question, after all, for some reason, the Big Bad wants them alive.\nCompare Kneel Before Zod.\nNot to be confused with Bathe Her and Bring Her to Me. Except when it is." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/MrImagination" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "A person with a huge imagination, who spends most of the time in his or her own imaginary world, frequently out of touch with reality. Often the main character, and usually a Cheerful Child and/or a Cloudcuckoolander. A show with them has lots of imagination sequences, maybe also dream ones. May have an Imaginary Friend. In many (but not all) instances, the imaginative character is a Reality Warper, and his/her odd daydreams can temporarily become real.\nIn case you were searching for the series Chuunibyou Demo Koi Ga Shitai, that's here.\n\nExamples" }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/HerCodeNameWasMarySue" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "A form of Stylistic Suck. Whenever a fictional character not established as being a (passable) writer creates a story, the main character will be a blatant Author Avatar Mary Sue. Whatever they want, their character gets. Often, all the other primary characters will have their own fictional counterparts as well, usually with one or two traits exaggerated greatly and generally portrayed in the light that the character sees them. This may include the villain of the story being based on a character the writer doesn't like. Most of the time, these stories will be treated as being pretty bad by the other characters (whether or not they express it depends on how nice they're feeling), and the work will often raise implications about their friend's desires and feelings about the people around him that will raise eyebrows. This is all usually played up for comedy, however the trope could also be used to tell the audience what the character writing the story wants and what he thinks of other characters, etc.\nSee also Parody Sue for the trope this draws upon and Dream Sue for the prototype. Compare Write Who You Know and Muse Abuse." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/StraightMan" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "Somebody has to set up the joke so the funny guy can deliver the punchline. That's the Straight Man. He rarely gets the funny lines, but has to have impeccable timing and delivery so that the comic (the other half of a comedy duo) can hit it out of the park. Bud Abbott (widely considered the greatest Straight Man of all time) had to say \"Who's on First?\" with just the right degree of earnestness and irritation so that Lou Costello could get big laughs saying \"Whaddya askin' me for?\"\nThe best Straight Men are so good they can sometimes get laughs just by delivering a straight line so well the audience knows what's coming. (This is essentially the basis of Bob Newhart's \"telephone\" routines: he was playing the Straight Man to nothing.) Other straight men in comedy duos have included George Burns (with Gracie Allen), Dean Martin (with Jerry Lewis), and Dan Rowan (with Dick Martin of Laugh-In).\nIn less-comedic works, the Straight Man is a Foil for the Bunny-Ears Lawyer, Magnificent Bastard or Loveable Rogue.\nIf the Straight Man is the lead in an ensemble like a Power Trio or Five-Man Band or even a show with Loads and Loads of Characters, this can lead to them suffering Designated Protagonist Syndrome by being overshadowed by the rest of the cast who get more interesting plot roles and character development (see also Standardised Leader).\nThe term can apply to women, but \"comedic foil\" is a more popular unisex term. In fact women in comic pairings have frequently played this role over the last few decades usually with Women Are Wiser coming into play.\nIn TV comedy, a Straight Man is frequently one half of an Odd Couple. In a Power Trio, they usually play the \"helpless observer\" role.\nIf you're looking for the trope for \"the only sensible character\", you probably want Only Sane Man; the two tropes can and often do overlap, and it's pretty rare to have one of each, but the Straight Man and the Only Sane Man are not automatically the same character. See also The Comically Serious, Straight Man and Wise Guy. Also Deadpan Snarker, which quite a few comedic foils are. If multiple characters take turns playing Straight Man, they have a game of Sanity Ball. Compare Boke and Tsukkomi Routine, where the \"Straight Man\" takes the tsukkomi role.\nNot to be confused with a heterosexual man, as many, many examples on this page show." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/HeWhoMustNotBeSeen" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "A regular or Recurring Character that is never seen on screen. There are three variants: The Voice, The Ghost, and The Faceless.\nSee also Ultimate Evil. Compare with He Who Must Not Be Heard." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/IHaveNoSon" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "Sometimes, what parents want for their children differs from what the children want to do, especially if the parent has plans for the child to Follow in My Footsteps. Sometimes the child wants to be himself in a career the parent dislikes. And sometimes, the parent struggles with this, but eventually comes around and supports his child.\nAnd sometimes he doesn't. And if the child (usually a son) doesn't step into line quickly, the offending parent quickly disowns him, disavowing all knowledge that this \"son\" ever even existed.\nCue the sad violin music — it looks like the kid is going to have to learn to make his own way in this harsh, harsh world all alone.\nThis doesn't mean that reconciliation is impossible further on down the track. But it usually happens years later, when the kid's a success and often when the parent is on their deathbed, and it's a long, bitter road until that happens.\nRest assured, however, that the chances of this happening are far higher than one might expect. The initial I Have No Son sequence typically takes place in flashback — we only learn the story because the now successful disowned son is giving us a sob story about how much he wishes his father would approve, or at least acknowledge his existence. If we see the event unfold in real time, then usually it gets wrapped up much sooner.\nBear in mind that the parent doing the disowning might not be entirely a jerk; sometimes, the kid just crosses a line they shouldn't cross (especially if they've grown up wrong) and deserves being kicked out with all ties severed. Again, reconciliation isn't an impossibility, but since this kid's bitter and twisted anyway don't expect it happening any time soon. And rest assured that the parent is going to have to justify their actions to the audience explicitly anyway, since the act of disowning one's own flesh and blood for any reason is well, pretty harsh. A justification commonly seen in a Crime and Punishment Series is when the parents essentially disown the child due to a crippling drug habit that the child has plunged into; this is often accompanied with a justification about how \"there's only so long you can watch or enable them to destroy themselves before you have to sever all ties.\"\nThis trope has various roots — most obvious is the tendency of many writers to be of Jewish descent. Orthodox communities could be particularly unforgiving when it came to children (particularly males) who decided to try and make their way outside of the Jewish community.\nOf course, overuse of this term has caused the words themselves to be considered a Dead Horse Trope, if not the entire plot itself. As a result most modern examples tend to skew toward the side of comedy. When the question is not about comedy but the descendant actually is the culprit, this trope can constitute Know When to Fold 'Em.\nThe Up to Eleven variant of this trope is honor killing, where the parents not only disown the child, but murder him or her.\nSee also: Changeling Fantasy and Where Did We Go Wrong?. Not to be confused with That Thing is Not My Child!." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/DoesNotKnowHisOwnStrength" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "After you gain Super Strength, one of the first things that happens is that you lack the dexterity and sensitivity to know when or how much of your super strength is being applied. Consequently, when trying to go about your daily grind, you accidentally break almost anything in your hands from pulling or squeezing too hard (that could include other people's hands). Jars and cups burst from the slightest squeeze, you burst through doors and windows, your shoulders chip at entrances/egresses and at worst, you cause severe damage to important facilities or even living beings. The toughest objects are brittle in your super-strong hands and you have to be extra delicate with how you hold or lift things. This is one of the most Omnipresent gags in the medium of superpowers as one of the missing Required Secondary Powers that has to be re-learned and remembered for daily functioning.\nNormally, it only happens to folks who gain Super Strength, not characters born with it and who had it all their life. After all, in real life an Olympic athlete that can lift several times his own weight can also pick up a caterpillar without squishing it and it would create all sorts of Fridge Logic to see a character with long-established super strength and constantly smashing plates or bottles and not wonder how they ever managed to feed themselves without learning how to control their power.\nThis trope is related to Blessed with Suck but is specific to strength and to powers which resemble strength (i.e. the ability to crush objects via telekinesis). It works as a trade-off where the massive raw power that's great for a battle makes Mundane tasks hell to perform. Another variation involves Functional Magic or Psychic Powers, where a mage or telekinetic who could decimate armies with their powers have to do chores by hand, because they lack fine control. After all, when you're incinerating enemies, \"Too much fire\" isn't really a problem. Sometimes leads to Stronger Than They Look.\nIf the hero's family is unaware of his powers, undoubtedly the blame for the damage will fall on 'shoddy construction' or on another house member's bad attempts at DIY.\nA frequent and more realistic variation of this is that the hero is able to control his strength, but when tempers flare or the hero is startled (or otherwise incapacitated, or perhaps inebriated) that control quickly lapses.\nCompare And Call Him George, when it happens to (formerly) living things. Related to Power Incontinence. Could be called the inverse of Gentle Giant. Can overlap with Unskilled, but Strong." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/HasTwoMommies" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "The two may be lovers, who have now become a family through adoption, a helpful donor, or through the wonders of magic or science with added likelihood of Patchwork Kids if the latter. The two may be close siblings (but not that close) or the best of friends, with one of them wishing to help out their single parent buddy. The two may be in that very fine line between the previous two examples, giving much Ship Tease and Ho Yay to the delight of their fans.\nWhatever the reason, it's all the same: A family unit that cheerfully ignores the traditional view of a family requiring a father and mother, by having two (or more!) parental figures of the same gender. Nevertheless, one of these characters may be referred to by the opposite gender parental term; sometimes in personal amusement, sometimes out of jest, sometimes to fit with the standard family unit. In fiction, Cast Speciation will usually result in the two parents fitting into a father and a mother role anyway.\nUsually the child will be the same gender as their parents. If done poorly and strictly, it can touch the Unfortunate Implication that a child can't be raised properly without a parent of the same sex, or that lesbians are misandrists and gays are misogynists.\nThe name of this trope came from Heather Has Two Mommies, a children's book by Lesléa Newman and Diana Souza that drew the ire of many conservative groups for its proposed use in the New York school system to portray a lesbian family as normal, wholesome, and happy.\nTaken to its literal extreme, this trope results in Homosexual Reproduction. Compare All Lesbians Want Kids.\n\nExamples" }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/PromotedFanboy" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "Some fans have all the luck. Somehow they've managed to be a part of the very industry—or even sometimes the exact show—that they're a fan of. This can range from the minor, such as a Contest Winner Cameo, to the point where the fan has creative control and is Running the Asylum.\nCompare Ascended Fanboy (a fan In-Universe), Ascended Fanfic, Big Name Fan (the ones most likely to be promoted), One of Us, Official Fan-Submitted Content. Contrast Hire The Critic.\nAs noted in the Doctor Who entry below, many long-running franchises (such as Star Wars, Star Trek, Kamen Rider, Marvel Comics, DC Comics and Transformers) have been on for so long that it's only natural that fans would get to work on them." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/DroppedABridgeOnHim" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "When a character is permanently written out of a show, especially killed off, in a way that is unexpectedly anti-climactic or mundane, they Dropped a Bridge on Him.\nThis can be a case of Writer on Board (or worse, Running the Asylum), but may also be an attempt to make the best of a difficult, real life situation.\nSometimes, when a character is Killed Off for Real in a universe where Death Is Dramatic, a lot of work is put into it. They may make a Heroic Sacrifice, or have A Death in the Limelight in their last appearance. If done well enough, it might even be their Dying Moment of Awesome. This trope applies when such things are generally expected, often because of previous dramatic deaths in the series, but don’t happen. Note that when Anyone Can Die, this trope does not apply.\nTo compare, take the NYPD Blue death of Det. Bobby Simone (Jimmy Smits) versus the death of Det. Danny Sorenson (Rick Schroder). Smits dies of Soap Opera Disease with a Tear Jerker sendoff. Schroder left the series, so his character is killed off-screen, between seasons.\nNamed for the death of Captain Kirk in Star Trek: Generations, which was expected to be a key, climactic event after 30 years of adventuring. Instead, they almost literally Dropped a Bridge on Him, when such deaths are usually reserved for Red Shirts.\nWhen done off-screen (like the Sorenson example), it's known as a Bus Crash. See also McLeaned, Sudden Sequel Death Syndrome, Distracted From Death and Not So Invincible After All. Not to be confused with Unsettling Gender Reveal, which was once called \"Dropped a Bridget on Him\". If this is done to a character repeatedly with the aid of Negative Continuity, see They Killed Kenny. If you're looking for this trope on an expanded scale, see Rocks Fall, Everyone Dies.\nAs a Death Trope, all spoilers will be unmarked ahead. Beware." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/PuttingAHandOverHisMouth" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "Similar to the Finger Muzzle, this is a more direct and easier way of shutting someone up. If Bob is being kidnapped, the best way to prevent him from crying out is by grabbing him and covering his mouth. Not only that, but Alice could easily do it if she just wanted him to stop talking for some reason.\nThis gesture can be both threatening or playful, depending on the context. Rescuers may sometimes use this if they have to sneak up on a friend from behind and don't want them alerting nearby foes by yelling in surprise. If in hiding, the more self-controlled character may use it to keep the frightened character from crying out inadvertently.\nIt bears noting that this method of trying to subdue someone can be defeated if the person doing it is capable of feeling pain, namely by biting down hard on said person's hand.\nCompare with Finger Muzzle, \"Shut Up\" Kiss, Standard Female Grab Area, and Finger On Lips. See also Bound and Gagged." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/ThroughHisStomach" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "Feeding someone, as a gesture of affection or an attempt to win it. (Or both.) The person doing the feeding may not even realize why they feel this desire to feed the other. While they do not have to cook it themselves, that adds to the significance.\nRelated to Feminine Women Can Cook, and often these two tropes are run together in the same plot line. If the main Love Interest is a Tomboy expect her to (often comically) struggle until some older mother figure takes pity on her and helps.\nTsundere are prone to it, because it has Plausible Deniability — and can even express unconscious emotions.\nGirls giving (or sharing) a bento with a male classmate is a common way to invoke this trope. The Japanese Valentine's day chocolate also often falls under this.\nMen who try this are seldom entirely comfortable with the fact that they are cooking something, but they do it anyway. (Much more pointed, that way.)\nIf the cook is spectacularly terrible, then Hilarity Ensues, particularly if she's the type to drop-kick the Love Interest when he refuses to touch her cooking because it just ate a hole through the table.\nIn addition to the more common romantic version, there is also the occasional mother figure to child version. In this version an older woman (occasionally male but usually a woman) tries to demonstrate maternal love to a younger person by cooking for them. If the child is a Broken Bird, or if the older woman is a Lethal Chef this can result in failure.\nThe Earth Mother, Granny Classic, and Mama Bear — and Real Men Who Cook — engage in this on a regular basis for their children. The Team Chef may do this to express the Power of Friendship for his True Companions. Indeed, any character who cooks on a regular basis probably does this as well. It acts more as a characterization trope, indicating a generalized benevolence toward a large group or even all of humanity (or more), than a particular relationship, though even here it often indicates that a person has been accepted into their True Companions.\nSupertrope of Your Favorite. Compare Tastes Like Friendship and Food As Bribe. Has nothing whatsoever, aside from Rule 34, to do with Right Through His Pants. For something that goes through someone's stomach violently, see Impaled with Extreme Prejudice. May overlap with Chocolate of Romance." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/OurMermaidsAreDifferent" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "Mermaids, or more generally merfolk, crop up quite a lot in fiction. However, like most mythical creatures and monsters, they are a little different every time and have different rules applied to them. Their dispositions, morality, and alliances vary depending on the author, and whether or not they can become human is a question everyone answers differently. Even their general appearance isn't fixed: see the picture.\nAppearance:\nMerfolk are generally portrayed as beautiful women (mermaids) or handsome men (mermen) with fish- or dolphin-like tails in place of legs. Sometimes they are not so pretty, but still fall under the Cute Monster Girl heading. Others are more blatantly sea-creatures with few human characteristics and are quite ugly, for example the Harry Potter merman (mermaid?) pictured. Sometimes they have features reminiscent of other, more exotic seas-creatures, and sometimes they are sea-animals that become human-like under certain circumstances.\nSome joke that merfolk have the fish half on top instead of on the bottom in order to resolve \"the Mermaid Problem\". Mermaids who are more human-looking (and modest) tend to wear Seashell Bras. And then there's underwater folk like Aquaman, Namor the Submariner, The Man From Atlantis etc. who look like normal humans for the most part but can survive and breathe underwater and may have some odd physical adaptations that are well-hidden until they return to the sea. It should also be noted that most mermaids have the \"fish half\" in a cetacean (horizontal fluke) configuration, rather than a fish's vertical configuration, since this is closer to how an actual human swims, though exceptions exist. Of course, cetaceans are terrestrial mammals which have evolved to an aquatic lifestyle, so this is probably fair enough.\nMerperson to Human:\nSometimes merpeople can turn into humans, or vice versa, under certain circumstances. The way this is done and differences in the \"rules\" surrounding this are numerous:\n The Splash Method: The mermaid can become human when they are dry and turn back when wet. Sometimes this is something all merpeople can do, and sometimes there are limits on how long they can do it.\n The Little Mermaid Method: The mermaid invokes a magic spell which allows them to turn human. Sometimes, this is at a hefty cost. In the original Hans Christian Andersen fairy tale, it's the title's character's tongue; the sea-witch responsible expects payment, and specifies, \"the best thing you possess will I have for the price of my draught.\". May be combined with the above.\n The Fredericka Bimm Method: Mermaids can switch forms more or less at will. Unlike the Splash method, getting doused with water is not a problem.\n The Magical Item Method: Common in some mythologies but, curiously, not often utilized in modern fiction. The Mermaid has a magical item which allows her to change from one form to another. Some of these items are obvious; a Selkie needs her shed seal-skin to return to her home in the sea. Or a mermaid could pass for human on land in a wheelchair. Others are... kind of random; a Merrow needs a hat made of red feathers to (depending on which variant on the legend you are reading) return to the sea or assume human form.\n And of course, some mermaids don't posess shapeshifting abilities at all — no matter how much they may want to change, the half-fish appearance is their default, permanent form.\nGood or Evil?:\nSometimes mermaids are portrayed as evil seductresses (sometimes called devil fish) who lure sailors to their deathsnote this is based on the myths of sirens which were originally birdwomen but who are generally portrayed as mermaids these days due to language confusion. In most mythologies, they display the inscrutable and sometimes dangerous amorality of The Fair Folk, especially if mermaids are treated as marine fae. Sometimes they are good but flirty and mischievous. Sometimes they are mostly innocent and naive. Sometimes they are honorable, and of these, several resent us for treating their ocean home so badly for so long. Sometimes (just sometimes) they are just like us and have all sorts of personas. Very often, though not always, they are Tsundere, or even outright Yandere types. Octopus or Squid-based mermaids—sometimes called cilophytes or cecaelia—are usually portrayed as evil, probably owing to the influence of Disney's sea-witch Ursula, or perhaps because of the \"alien\" nature of tentacles.\nOne thing that also tends to vary among depictions of mermaids is their ability to survive on land: some depictions show them being completely unable to breathe out of water, others show them being able to stay above the surface but needs to be wet to avoid drying out, and some show no qualms at all about leaving the sea and can stay out of water seemingly indefinitely (except for not having legs).\nMost merfolk can communicate with fish and sea creatures, regardless of whether they eat them or not. Expect merfolk to remain naked no matter how deep they swim or how little protection their skin has, though their bodies might have some unseen protection against the cold and high pressure of the depths.\nUnscaled Merfolk is a Sub-Trope, where the non-human parts are not a scaled fish; see also Selkies and Wereseals.\nSee also Mermaid Problem, Shape Shifting Lover, The Fair Folk, Sirens Are Mermaids and Friendly, Playful Dolphin, Heroic Dolphin and Sapient Cetacean.\nMay occasionally overlap with Fish People, though they are generally more of an anthropomorphic fusion than a half-and-half mix." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/TheCanKickedHim" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "The fictional bathroom can be a truly dangerous place. It is fraught with assassins, demons, and killer mutant creatures, to name a few. This is very possibly why Nobody Poops. A death or injury in the bathroom is a one-way ticket to a legacy of ignominy, and the prevalence of scary water-closet events seems to speak of a deeper human fear of vulnerability in this most private of places. Not to mention that some tricky assassins may exploit the assumed privacy and safety of the bathroom by Camping a Crapper.\nIn this sort of situation, the phrase \"Make It Look Like an Accident\" can take on disturbing subtext.\nThis generally has nothing to do with Ass Kicks You. See Swirlie for less injurious (hopefully) examples.\nAs a Death Trope, all Spoilers will be unmarked ahead. Beware." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/DudeShesLikeInAComa" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "This is a kissing trope most common in anime and manga; the setting is a bedroom, or simply a place to rest, and two characters, one often harboring unrequited feelings for the other.\nThe premise is that one character is unconscious, whether previously knocked out, feverish, comatose, in a drunken stupor, or simply asleep; the other falls for 'their attractive sleeping face', and unable to resist, leans in to lock lips...\nThis situation will progress differently depending on the genre of the series, and the status of the characters. They may or may not pull it off, resulting in an Indirect Kiss, First Kiss, etc., or they may be interrupted by another character bursting in, usually including a guilty start.\nIt is not unknown for the other person to be feigning sleep when they realize that the character might kiss them.\nFrequently used in shojo series and shonen love comedies, where the girl's vulnerability seems irresistible to the male character. This trope is fairly gender-equitable, though, as girls are also prone to this urge. In Real Life, it is known as somnophilia.\nSister Trope to Converse with the Unconscious.\nContrast Kiss of Life, which is often mistaken for this. One common reason why Orderlies Are Creeps in fiction is that they're often portrayed as being into this." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/WhatDoesSheSeeInHim" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "A man and a woman coo over each other. A bystander turns to another and says, \"What does she see in him?\" Or, conversely, \"What does he see in her?\"\nMay also inspire comments about how love is blind — sometimes justly, sometimes unjustly. Common with Romantic False Lead and the Love Triangle. Ugly Guy, Hot Wife may inspire it. So may Single Girl Seeks Most Popular Guy, if she actually gets him. When jealously motivated, may be coupled with What's He Got That I Ain't Got?!.\nIn Single Woman Seeks Good Man, likely to be said by less mature characters than the woman; in All Girls Want Bad Boys, the characters who say it are prone to have a better view than the girl, who is prone to dismiss it with You're Just Jealous.\nWhen one of the couple wonders \"What do you see in me?\" it's I Can't Believe a Guy Like You Would Notice Me.\n\nExamples" }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/OnlyICanKillHim" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "The protagonists of any given story are, of course, larger than life. Expecting the various extras and Red Shirts to actually accomplish something noteworthy would probably come off as anticlimactic. But even among the various named characters, there's clearly a hierarchy involved. That hierarchy, among other things, mandates that only the protagonist can achieve certain things. Nowhere is this more clear than when battling the Big Bad, often Because Destiny Says So.\nAnyone other than the main character will almost inevitably fail to defeat the Big Bad. It's a rule of drama. Any poor schmuck who tries, be he The Lancer, the hero's closest friend, the hero's Love Interest, or a random soldier, will almost certainly be cut down without the Big Bad breaking much of a sweat. There will be gloating. There may be slow-motion footage of their fall, and dramatic music.\nCamera pans to the hero. Cue the Unstoppable Rage.\nThe reason writers came up with the Hero Secret Service, which gives the rest of the Five-Man Band something important to do without directly taking part in The Hero's mission.\nOften overlaps with the Chosen One, as well as This Is Something He's Got to Do Himself. Differs from The Only One Allowed to Defeat You in that it's a matter of raw ability, not personal preference.\n\nExamples" }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/HideYourLesbians" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "The main character and her boyfriend share their First Kiss onscreen and, from then on, we are treated to a pile of onscreen mushy goodness (if we're lucky). The main character's best friend and the boy that was after her get together amidst cheers and blushing. But wait, weren't they hinting at another couple? Oh, the Schoolgirl Lesbians? Forget ever giving them a resolution — at least onscreen. Heck, the plot won't even say that there is a relationship, so that technically, anyone arguing that there isn't one is not wrong. They may live together, they may never get with someone else, they may sleep in the same bed; but they will not say that they are a couple \"that way\". It's called \"the love that dare not speak its name\" for a reason.\nCanon homosexuality, except in the genres that focus on it specifically, is rare and sometimes restricted to subtext — no outward shows of affection onscreen except for that which could be interpreted as just friends if you squint hard enough.\nHappens most often in series aimed at kids or teenagers — and as the name shows, most often to female characters. One of the reasons for that is a Discredited Trope: the idea that lesbianism was a form of asexuality. It was believed that the average lesbian wasn't actually attracted to women but was instead irrationally afraid of men (and therefore sex in general, because if there isn't a penis involved it isn't sex), usually because she had been hurt by a \"bad guy\". She chose women only because she still required emotional fulfillment, which was thought to be the only thing women wanted out of sex. This trope (and its much darker companion, the idea that a lesbian could be turned straight by a \"good guy\", even if he has to rape her) has been largely forgotten, but echoes still reverberate in many areas.\nPart of the reason that Yaoi Fans and Yuri Fans alike have reputations for pairing up any two guys or gals who interact with each other; most canon couples are reduced to subtext as is, so why not elaborate?\nDo not confuse with But Not Too Gay; that trope is for when there is a confirmed same-gender relationship in the work, but the physical contact between the partners is much more G-rated than the opposite-gender couples. This trope is for when there is same-gender couple in the work that is never explicitly confirmed as a couple.\nMinion Shipping is generally immune, as villains can do (almost) whatever they want without being called out on it.\nRelated to Will They or Won't They?, Bait-and-Switch Lesbians, Have You Tried Not Being a Monster?, Ambiguously Gay, But Not Too Bi. Compare No Hugging, No Kissing and Ship Tease. See also Bury Your Gays and Get Back in the Closet. Naturally rife with Unfortunate Implications.\nContrast Everyone Is Bi, Cast Full of Gay, Have I Mentioned I am Gay?, and Relationship Reveal. The opposite of Girl on Girl Is Hot and Guy on Guy Is Hot (when the characters are old enough to make out and the act is fetishised)." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/BigBrotherMentor" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "This character is the hero's good friend. The hero can fool around with him, go to the bar with him for a drink and talk about some good old man-business with him. Additionally, the character, being older (though mental age matters more than physical age) and wiser than the hero, also acts as a mentor to the hero in times of need or advice.\nHowever, just because the Big Brother Mentor cares about the hero doesn't mean that he won't rebuke him if he gets out of line, and he would even go as far to deal with him physically. He only wants the best out of the hero, but won't hesitate to educate him the hard way if the hero shows reluctance to learn or has a tendency to run headlong into danger. In essence, he's the ideal big brother figure who knows when to get friendly or strict.\nIn anime, this kind of character is often addressed using the more informal \"Aniki\" instead of \"Onii-san\".\nOften, this character is doomed to die — both to bring the Hero out of the character's shadow, and to give the character an emotional buildup.\nThis is a subtrope of The Obi-Wan.\nIf he and The Hero are romantically involved, or just have enough Ho Yay, this can become Lover and Beloved. Differs from Aloof Big Brother in that the Big Brother Mentor doesn't have to be a literal big brother and actually gives a damn about his \"little siblings\" (Or shows it quite more often than a merely emotionally repressed Aloof Big Brother). Compare with the Stern Teacher, tough and strict but loved by everyone. Not to be confused with Draco in Leather Pants." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/IdenticalGrandson" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "A character's descendant or ancestor is physically identical (or would be, except for small cosmetic changes) to the character himself, and often has the same name. A subsection of Uncanny Family Resemblance. Of course, he might just be his own ancestor.\nThis is normally the result of budget considerations when casting Time Travel stories, the consequence of having a long-term contract for a star when a show permanently jumps generations for some reason, or an excuse to do an Elseworld story with essentially the same character in a different setting.\nIf the character and descendant are one and the same, then that's My Grandson Myself.\nDespite the name, the trope is limited to neither males nor grandchildren.\nThis trope gets somewhat disturbing if you over-think it. Having one's grandparents look exactly like their grandchild and said grandchild's mate has pseudo-incestuous imagery.\nUsually an Averted Trope by this point. Compare with Visions of Another Self. When it's the life story that's identical, the character is a member of Generation Xerox.\nGenerally the result of one of three things: A) It's simply cheaper to have an actor play their own ancestor than try to get a new actor to play them, B) Executives assume people are too dim to recognize that someone is a character's ancestor and thus a precursor to that character if you don't find some way to constantly remind them, or C) Both.\nOf course due to similarities in genetics this can be compared to a Real Life version of the animation trope Only Six Faces." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/DidNotGetTheGirl" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "A rare case where The Protagonist— who is clearly not celibate — doesn't end up with the romantic female lead. Someone else wins her heart or she has no choice but to marry someone to save her family or something. For whatever reason the hero ends the story alone. It can be played either for comedy or tragedy. It isn't always a Downer Ending, but it sure does tend to be that way.\nDespite the name, this trope can just as easily apply to not getting the guy.\nSubtrope of No Romantic Resolution. Compare to Better as Friends and Romantic Runner-Up. Contrast Everything but the Girl, where the protagonist usually does get the girl eventually. Not to be confused with two leads not ending up together because one of them dies — that is a different trope, and Platonic Life Partners where neither of them wanted each other in the first place. See also Dump Them All, where the protagonist rejects all of his Love Interests instead of them leaving him.\nSpoileriffic, obviously." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/CutHimselfShaving" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "An unlikely excuse used to explain away a suspicious wound or injury.\nFor example, when the police question a murder suspect, they find that he has some cuts or scratches on his face, consistent with the type of wounds that the perpetrator would incur in that sort of crime (perhaps because someone with a knife fought back). When asked where he got them, nine times out of ten he will say he Cut Himself Shaving. Likewise, a guy who beat someone up will often say that the victim \"fell down some stairs\" or \"ran into a door\" whenever being questioned by the cops.\nA subversion is the character who really did walk into a door, but everyone assumes they're covering.\nIn anime and manga, this trope is usually just explained by all characters as \"I fell,\" and keeping it unspecific. This leads to wondering by the characters, as by the reader, \"Fell on what?\"\nAlso frequently employed by a Super Hero when he must preserve his Secret Identity by explaining away wounds sustained in battle. It may also be used by someone attempting to cover-up Self Harm or someone being abused at home (in which case \"I fell down the stairs\" is a common phrase).\nAnother variant, found in military fiction and military science fiction, has two men - often an officer and an NCO - engage in a brawl in a nice, quiet, out-of-the-way spot to settle some point of honor, with the unspoken agreement being that each will cover for the other's injuries (frequently by claiming to have been practicing hand-to-hand combat techniques.) This is because in many of these settings, striking a superior officer, regardless of the reason, is an offense worthy of court-martial and with very heavy penalties.\nFor the lethal version, see The Coroner Doth Protest Too Much. If he really did cut himself shaving, There Will Be Toilet Paper. Not to be confused with Dangerously Close Shave, which is about the barber cutting other people." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/LostHimInACardGame" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "Gambling seems to be a natural human activity. We have friendly bets on when Margaret's baby will be born. Not-so-friendly bets on which sports team will be victorious this year. Sometimes we stake money and sometimes the stakes are less tangible.\nIn fiction, however, it's perfectly okay to bet people in a game of chance. Typically a comedy trope, although you might find it in serious fiction with a setting where slavery is accepted.\nOften (especially if this is used to resolve a Love Triangle), whoever it was who thought the person was theirs to bet in the first place will \"lose\" them, whatever the result of the wager itself. That doesn't necessarily mean that the other party will \"win\" them, however.\nThis happens a lot with employers betting employees for whatever reason, yet the Justification — betting their employment contract rather than the employees themselves — is almost never used.\nMost often the card game is poker, but theoretically any form of game that allows The Bet would work. A comedic form of the Absurdly High-Stakes Game. Compare the Bachelor Auction, which is consensual on the \"traded\" person's part." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/CantHoldHisLiquor" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "People you should never, ever offer a drink to. As soon as they even taste a drop of alcohol, they either pass out (putting you in danger in case that person should really be awake) or go off the deep end. It rarely gets as far as endless vomiting or a near death experience, or anything else that usually happens after alcohol poisoning, because this is primarily a comedy trope, though it can be used in a dramatic work as well if the person in question is a particularly abusive mean drunk.\nThis trope is extremely common, and is most often used for comedic effect. If you need to wake him up fast, you'll need a Hideous Hangover Cure.\nMay overlap with Kissing Under the Influence, Intoxication Ensues, Drunken Master, Lampshade Wearing. Polar opposite of Never Gets Drunk.\nIf instead the character gets intoxicated from something that's not alcoholic at all, they're Drunk on Milk.\nOf course, this is often also a case of Truth in Television.\n\nExamples" }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/BeastMan" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "The beast man (or woman, this is a gender neutral trope) is a human who has several animalistic physical and behavioral traits. They will have claws (even on the toes), fangs, either heavy hair or actual fur, possibly horns or even scales, and the eyes will usually be structurally different or yellow. Also, don't expect them to shave or wax, or have good oral hygiene.\nThey'll usually behave aggressively with limited impulse control and attention span. If they have super powers, these will usually include Super Senses, Super Strength, Wall Jump, Running on All Fours and an enhanced immune system coupled with a Healing Factor. Oh, and they can speak with animals, of course. They may or may not be evil, but a good beast man will have to fight their base impulses very often. Good Beast Men will be in tune with nature, evil ones will just embody everlasting rage.\nIf this isn't the character's default, natural form, it can result from a Werewolf using a Partial Transformation into a Wolf Man, Shapeshifting, or genesplicing/magical transformations. This person is basically a Wild Man who has become part of the natural world.\nSubtrope of Monstrous Humanoid. See also Half-Human Hybrid, Fauns and Satyrs, Little Bit Beastly and Petting Zoo People. Overlaps with Different Orcs. Compare All Cavemen Were Neanderthals and Crown of Horns. Contrast Plant Person, with whom they might team up into a \"Nature Duo\". Often overlaps with Animal-Themed Superbeing." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/HypnotizeThePrincess" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "The Damsel in Distress is in the clutches of the villain, but the villain decides that chains, cages, cells, and other ways of containment are too unreliable. The hardest chain for The Hero to break while freeing this prisoner is in the damsel's own mind. Thus the villain hypnotizes the damsel. As with Save the Princess, this need not be a princess or even a lady.\nThe motives can be varied, but the two most common are (1) the villain wants the captive for a lover (this is easier than coercion), and (2) to make the captive betray the hero once \"rescued\". How the damsel is controlled can be done by straight-up hypnosis, possession or a Love Potion (for either motive).\nNote that this rarely works well, save for cynical enough stories. The Evil Overlord List would likely recommend this be done just to get her to cooperate in that quiet civil ceremony so you can marry her with as little fuss if possible. Anything else is just asking for trouble.\nOf course, Freud Was Right, and such brainwashing is inevitably Fetish Fuel for some and subject to Rule 34.\nCompare Hypno Fool, Stockholm Syndrome (doing this over long term), More Than Mind Control, I Have You Now, My Pretty, Hypno Trinket.\n\nExamples" }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/IfYouEverDoAnythingToHurtHer" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "The one true manly way to concede defeat for the girl's heart is to tell the winner that, if he ever screws up, he should expect an ass-kicking of epic proportions. Usually uttered by (or sometimes to) The Lancer or The Rival.\nThis establishes that the loser:\n Realizes he has lost.\n Does not give up his role as male protector or lose face for losing\n Is decent enough to want the girl to be happy, only expressed in a guy way.\n Is holding the winner to a very high standard.\nThe manly and gracious thing for the winner to do is to accept this statement. \"I would be disappointed if you didn't.\" This is not (usually) an insult or a threat, but an agreement between guys who both want the same girl to be happy.\nThis can also be said by a parent or older brother of the girl, who is relinquishing their previous role as \"main male protector.\"\nWhile this is generally a male-character trope, there are exceptions (sorted by gender in the examples).\nAnd yes, an asskicking of epic proportions will follow should any betrayal occur." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/GirlOfMyDreams" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "A character, usually male, first meets a stranger, usually female and presumably a future Love Interest, in a dream of his, before meeting her in real life and discovering that she wasn't just an invention of his subconscious. She really is the \"girl of his dreams\".\nHow did a real person like her end up in his dreams? Maybe they were his Dreaming of Things to Come, or his dreaming of his own time. Maybe it was Telepathy on her part. Or maybe they happened to meet each other's consciousness in a collective Dream Land.\nEither way, meeting someone of your desired gender in a dream always means that the person is special, or otherworldly, or fated to be yours. Romantic love is practically guaranteed." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/IThinkYouBrokeHim" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "A Stock Phrase. When a character is struck speechless, stunned, going through a Heroic BSOD, or generally unresponsive for whatever reason, another one will tell the responsible \"I think you broke him/her.\" Or someone in the peanut gallery will just comment, \"I think X broke Y,\" or any variation thereof. Most often whispered as an aside.\nFrequently used for comedy, but can be part of a dramatic setup too.\n\nExamples" }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/LikeFatherLikeSon" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "As Truth in Television, children tend to act, at least a little, like their parents. It may have something to do with living together for years and years. Or not.\nEither way, stories often drive home this point by saying Like Father, Like Son, or like mother like daughter, or like any relative like any other younger relative. This causes sometimes predictable plotting, angst, and dramatic tension.\nObviously, often happens to any character with a Truly Single Parent.\nA Sister Trope to Like Parent, Like Spouse.\nA Super Trope." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/HeyItsThatGuy" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "Most actors appear in more than one work. Often, this means that you don't know their name but are forced to just exclaim \"hey, it's that guy!\" when you see one of these.\nIf you're watching Law & Order or other Clueless Mystery, it might result in Narrowed It Down to the Guy I Recognize.\nVoice actors in Animated Shows, as well as live action voice dubs for foreign language shows, have the similar syndrome.\nIf you can't quite remember which show the actor was in, it can result in much time spent on IMDB, trying to narrow down where else the viewer has seen that actor. If you get stuck, try You Know That Guy — someone might help you.\nCompare Actor Allusion, You Look Familiar, You Might Remember Me from..., Hey, It's That Voice! and Plays Great Ethnics. Inverse of Retroactive Recognition. Parent trope of What The Hell, Casting Agency?. Retroactive Recognition happens when a That Guy later becomes a big-name star.\nHey It's That Guy!, now in (slightly outdated) book and documentary form.\nNot to be confused with the television program That Girl." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/DisposableWoman" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "A female character, typically the wife, sweetheart or occasionally the mother or daughter of the protagonist, who is present in the story just so that she can be either kidnapped by the bad guys, thus becoming a Distressed Damsel, or find herself Stuffed into the Fridge, giving the protagonist a pretext for Revenge. In a series, she can be frighteningly easily forgotten or replaced once her value as a plot device has expired, if she has been previously developed at all. If instead of being conveniently forgotten one or more characters continues to mourn her or think about her, if she appears in ongoing flashbacks or dream sequences, she is not a Disposable Woman, she is a Lost Lenore (see below).\nThis trope is closely related to The Lost Lenore. The key difference is that a Lost Lenore continues to have a recognised impact on the characters and story after her demise rather than conveniently vanishing from the minds of characters, audience and creators after having served her function as catalyst.\nCompare I Let Gwen Stacy Die, Doomed Hometown, Men Are the Expendable Gender, and Forgotten Fallen Friend.\nContrast Disposable Sex Worker and Disposable Vagrant, where what makes them disposable is the expectation that no-one will miss them.\nWhen it happens to male characters, it's often Retirony (the hero cop losing his partner, etc.). Literal Gender Flips do exist (ie a man who is killed off to start a woman's search for Revenge) but are seldom seen. Tragic death of other family members may need another trope. Even if they somehow survive one movie, there's still Sudden Sequel Death Syndrome. If this happens often enough with love interests, it can become a Cartwright Curse.\nNot to be confused with Disposable Love Interest, a character who is there for a Token Romance and gets written out with little explanation so a fresh one can happen in the sequel. Related to Temporary Love Interest, where a character has a serious relationship with a short-lived character who is then inevitably written out to preserve the status quo." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/CharacterAsHimself" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "When a TV show gives a fictional character billing in the credits as himself. Frequently done as a joke or to give additional verisimilitude to a \"based on a/an (un)true story\", although it can also be used to hide a spoilerific cast change. Another reason this is done is if the \"character\" in question is an inanimate object or an animal.\nPlease note the distinction between this and As Himself. This trope is when a fictional character is credited as himself; As Himself is when a real person is credited as himself.\nCompare Not Named in Opening Credits and Animated Actors." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/ActuallyIAmHim" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "A character, usually the protagonist, is looking for someone, often an older, wiser character. During the search, he meets a stranger, and the conversation turns to the sought-after character. The stranger will typically either respond, \"Oh, I know him well...\" or else act as if he's never heard of the person. Either way, in time it is revealed that this stranger is the sought-after character.\nOften, the stranger is playing dumb about their true identity in order to assess the searcher's character and intentions, the idea being that the searcher's behavior will be more genuine in the presence of someone they perceive to be just an ordinary stranger. This can lead to a painful lesson for the searcher once he learns the truth about the stranger, making this a favorite form of introduction among Trickster Mentors.\nIt still satisfies this trope if the person tells the searcher straight-out, without pussyfooting around or playing games, who he is, as in the opening Star Wars quote.\nFurther confusion can arise if the sought-after character is of a different gender, race, species, etc. than the searcher was expecting, such as when a sought-after \"doctor\" turns out to be a woman scientist. Or maybe the searcher was just Expecting Someone Taller.\nCan also be Luke, I Am Your Father if the sought-after character is the searcher's parent. See also You Have No Idea Who You're Dealing With, Right in Front of Me, King Incognito, Actually That's My Assistant, I Am One of Those Too, But He Sounds Handsome, Mistaken for Servant, and ...And That Little Girl Was Me. For when you weren't expecting something to be a character at all, see I Am the Noun.\nNot to be confused with Because I'm Jonesy.\nGiven that this trope is about a plot twist, there be spoilers." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/AndThatLittleGirlWasMe" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "One character treats another to a lengthy third-person anecdote. Either the receiver, or the person telling the tale, will be one of the crucial characters. Usually it's revealed, but sometimes it's just implied.\nCan be used to inspire a fellow character in a similar predicament, but it's most often a means of explaining crucial backstory. You wouldn't think you would explain something the heroes need to know in a way that looks like wasting their time with some story about irrelevant third parties, but it seems to be a pretty effective distancing tool for these narrators.\nSeen often in Glurge. If you're reading one, and the wise old stranger is telling the discouraged younger person an inspirational tale of someone who was just like them once, you know it's coming.\nCompare You Know Who Said That, where the anonymous example of some value turns out to be a historical figure. Also compare I Have This Friend, Actually, I Am Him, and Let Me Tell You a Story. For when the entire story turns out to have been one of these, see Narrator All Along. If the main character does this, it's Nostalgic Narrator.\nBecause of the nature of this trope, expect unmarked spoilers ahead." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/BreakHisHeartToSaveHim" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "So, you've got someone you deeply care about, and who cares just as much about you. However, you know the two of you cannot stay together: being near you, or just the fact that he loves you is putting him at risk. You tried telling him, \"It's Not You, It's My Enemies\", but it didn't work — he knows he'll be in danger, and he's okay with that.\nBut you're not. So, you lie to him. You pretend to be mean, callous, and completely disrespectful of his feelings. You say you never loved him. You do everything you can to make him hate you, because you know that's the only way he'll stay away from you and, in turn, from danger: you have to break his heart to save him.\nThe human version of Shoo the Dog, quite possibly the most extreme manifestation of I Just Want My Beloved to Be Happy; this is when a character does ostensibly hurtful things to their beloved because they know it's the only way to protect them from some sort of even greater harm. Cruel to Be Kind is the supertrope. See also, Break Up to Make Up. Can lead to a character regretting taking an action that they now believe Was Too Hard on Him. Note that when this trope is done poorly, it will often collide with the Idiot Ball if there's an obvious solution to the problem that does not require such a drastic step or your deprivation of key information is actually going to put that person in greater danger than being honest would have. In particular, it's likely to backfire spectacularly when the pain of the breakup just drives the other person to do exactly the thing you needed them not to do (and especially if you skipped the \"It's Not You, It's My Enemies\" step).\nUnsurprisingly, while it usually works temporarily, in many cases, it doesn't hold up for very long.\nCompare Inspirational Insult." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/HisNameReallyIsBarkeep" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "As the Everyone Calls Him Barkeep trope says, some characters have the misfortune of being known only by their job title. This trope is about those rare times where Everyone Calls Him Barkeep because \"Barkeep\" is the guy's actual name. May happen as a result of Who Names Their Kid \"Dude\"?. Alternatively, maybe the guy had his name legally changed to \"Barkeep\" because he likes that name better than his given name.\nMilder examples can include a nickname that turns out to actually be the character's name. For a full comedy incarnation of this trope, the given name will be the full job description.\nMay involve Spell My Name with a \"The\".\nPatronymic can be considered a subtrope. Closely related to A Dog Named Dog, when something is named for its species." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/LetMeAtHim" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "A Crime Time Soap and Detective Drama trope.\nA detective (rarely a great one, though), angered by a possible or actual perp being smug, lunges for them and has to be restrained by fellow officers. Not usually part of Good Cop/Bad Cop, more sheer hatred on the part of the detective (often when It's Personal). Particularly vulnerable to stuff like If You Kill Him, You Will Be Just Like Him when there is actual murderous intent (this is quite rare in police show, though)." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/AnimalsHateHim" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "How a character treats, reacts to, and is reacted to by animals delivers a wealth of information to a viewer. The virginal Princess Classic can summon woodland friends with song, the Jerk with a Heart of Gold will (despite hating animals) get Licked by the Dog, while the man in the Black Cloak with a Red Right Hand causes everything around him to wither and die, and the Evil-Detecting Dog just won't stop barking at him!\nThen there's people who, regardless of their morality or niceness, simply have Animals Hate Him. Always, without fail. Offering a dove crumbs gets him dive bombed. Petting a cat will result in getting inch deep claws dug into his leg, and don't even ask what happens when this character is stupid enough to visit the woods or a zoo.\nThe reason for this animalistic antagonism varies. Maybe they just smell wrong, or 'good'. Perhaps they try too hard, or just have terrible skills at reading an animals' mood. Maybe they're just a Butt Monkey or Chew Toy. Maybe they were especially cruel to animals in a past life. Sometimes there's no explanation; animals just don't like him. Characters who consider themselves \"in tune with nature\" a la the Nature Hero or Granola Girl, or \"so pure and innocent\" that they should receive friendly animal treatment are the likeliest to be treated this way, often to highlight just how out of touch they really are.\nThat is, this is an animal combination of Everything Trying to Kill You and 0% Approval Rating. Compare Scare The Dog, where animals react with terror, not hate, although there is some overlap." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/PeacockGirl" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "When a humanoid person has a peacock tail, is wearing a bunch of feathers arranged as though it was a peacock tail (actually not a tail, but a separate group of feathers known as a \"train\"), or just has peacock feathers in some way (even around the shoulders or as a headpiece).\nThis is common on girls in fiction, yet the peacock train is a feature of male peafowl in Real Life (females — peahens — lack the train and, at least in the case of the Indian (Blue) peahen, are rather drab in color (the Green peahens are much more colourful, only slightly less so than the Green peacock)); but such a flamboyant thing on a human guy would be, well, flamboyant. So it's often human girls that have this, although a guy having one isn't entirely unheard of.\nA Sub-Trope of either Little Bit Beastly or Fluffy Fashion Feathers, depending on whether this character actually has a tail or is just wearing one.\nCompare Winged Humanoid, Giant Waist Ribbon.\nNot to be confused with women who work for NBC, or with Agent Peacock." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/GenderAndSexualityTropes" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "All about gender and sexual identity. For romance, see Love Tropes. For eroticism and sexual behavior, see Sex Tropes. For tropes that bend gender lines, see Gender Blending Tropes." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/YouCanKeepHer" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "Classic scenario: Alice is kidnapped. The kidnappers contact Bob, who is the legal guardian/spouse/caretaker/someone who should care about Alice and explain they are holding her for ransom.\nHowever, Bob has no intention of paying. Either he flat out doesn't care, he doesn't think that much money is worth it or considers the kidnappers to have done him a favor. The fact that the kidnapped party may die does not faze him in the least. Of course, karmic justice normally ends up biting him in the ass. May end in a Too Spicy for Yog Sothoth situation if the kidnapped party really is THAT annoying — see Pity the Kidnapper.\nA small variation of this would be Bob not taking the kidnapping seriously, seeing as Alice has previously faked similar attempts as a cry for attention. Unfortunately, this time it's for real and the Crying Wolf principle applies...\nSee also Shoot the Hostage, for cases where disregard for the threatened party is more proactive and immediate. For a more straight Super Trope of this, see also Threat Backfire." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/NarrowedItDownToTheGuyIRecognize" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "You're watching one of the various Law & Order shows, the story is starting to pick up, and as the detectives start going through the usual Red Herring suspects, they interview the victim's mom and it's Angela Lansbury. Or their poolboy is Ian Somerhalder. Or William Mapother. Or \"Trey\" from The O.C.. Even though the detectives pass them over at first, you just know that they're going to be important in the episode, because they wouldn't have paid to cast a well-known actor in a throwaway role. It is very common that the most recognizable actor is the guilty party.\nSometimes you can narrow it down before the show actually airs due to the commercials for an upcoming episode playing up the guest star.\nThis can become self-subverting when watching reruns; someone high-profile now might've just been starting out when they appeared on the show. (Harrison Ford has said that, early in his career, he spent a lot of time playing \"the guy that didn't do it\".)\nThis can also happen in films. If a high-profile actor is playing a supposedly minor role (after becoming high-profile), keep a close eye on this person. Compare One-Scene Wonder, Contractual Immortality. Some better-funded productions seek to subvert this by making all of the suspects well known actors, so you only know that one of them did it. If the villain uses a disguise, they can avert this by having separate actors play the normal and disguised forms.\nSometimes called Chekhov's Guest Star. See also: Hey, It's That Guy!, Traitor Shot, Not-So-Small Role. Compare also to Chekhov's Gunman, where the viewer is made suspicious by the strange irrelevance to the story of an apparently minor character rather than by the casting of a known actor.\nContrast Dead Star Walking, where a well known actor appears to have a major role, but is doomed because they're too expensive to be a regular cast member.\nSPOILERS AHOY!" }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/ToKnowHimIMustBecomeHim" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "The hero decides that the only way to defeat the enemy is to understand how the enemy thinks in the most intimate and experiential way possible, to get inside the enemy's mind either literally or figuratively. The hero may accomplish this with the aid of drugs, Psychic Powers, or some other strategy. May result in a Not So Different realization, or even a personal epiphany (or Epiphany Therapy if done badly). There is also the danger of Becoming the Mask when attempting this with a practical approach!\nCompare: Consulting a Convicted Killer, where the law-abiding protagonists ask a dangerous criminal with a background much similar to the person on the loose to try to suss out how the criminal mind works." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/GiveHimANormalLife" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "Your hero has just become a mommy or a daddy — wow! Either he wasn't planning on it, and has managed to admirably rise to the challenge of parenthood, or this is something he's always wanted, and having a baby is making many of his dreams come true. (Sometimes, it can be a mixture of both)\nBut it doesn't take long before there are problems. Having a child may have changed the hero, but it hasn't changed his life any. He still has to go out and save the world, fighting criminals or slaying monsters wherever they may roam. This kind of thing really cuts into spending quality time with the kid he wanted so much a few episodes ago, and can make him question how selfish he might be being.\nThere's also the inherent issue of him being a complete and total danger magnet. All those psychotic bad guys who, by virtue of existing and hating the hero, nearly destroyed the hero's love life (and perhaps continue causing dangerous hiccups in the hero's attempts at normalcy) are still out there, and couldn't care less that there's a baby in the picture now. In fact, how lucky this is for the villain that likes to attack the hero by kidnapping/torturing/killing his nearest and dearest! The hero now has someone else to lose.\nLast, but never least, if the hero is supernatural or paranormal in some way, there's a good chance the baby will be just like him, with powers of his own that make him a target even without Mom or Dad's help.\nWell, the hero loves his precious offspring more than anything else in the world, and couldn't bear it if anything happened to the kid, or if the kid had to live with all the stuff the hero has to every day.\n\"I just want to give him a normal life.\"\nBeing just that noble, the hero will then give his child up, to live in blissful normalcy with ordinary parents that will presumably provide the child with a life that doesn't have any supervillains.\nIt should be noted that despite the hero's best intentions (and presumably those of the adoptive parents), it's not unsual for the child's life to be anything but normal, especially if Super Powerful Genetics comes into play as mentioned above. (Or if the child is to grow up to be the protagonist of their own series.)\nIf the other parent enforces it, it's Turn Out Like His Father.\nCompare It's Not You, It's My Enemies, where a hero goes through a similar process (with a similar result) with a love interest instead of a child. Related to Deliver Us from Evil for villains—many a bad gal has done a Heel-Face Turn because the kind of life she leads is one she doesn't want for the kid in question. Also related to Muggle Foster Parents when the story goes back to follow the kid. Don't Tell Mama is an inversion of sorts where a character (usually a bad guy, but sometimes a good one) keeps an uncomfortable or disturbing truth about himself or his profession from his mother, family, or True Companions so that they can live a normal life in blissful ignorance.\n\nExamples" }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/BigLittleMan" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "A Visual Pun where an extremely short character is introduced in a manner that makes them appear much taller than they actually are. Also the inverse, where someone (or something) of great size or height is made to appear normal-sized at first, or perhaps introduced in a shorter or chibi-like form.\nA subtrope is Big Shadow, Little Creature, where this is done via a large shadow cast on the wall. Depth Deception is the Super Trope — all examples that don't involve people should go there. May involve the use of Hitler Cam. See also Mister Big." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/UptownGirl" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "You know the story. It's a love story.\nOur lovers are from different worlds — one wealthy, one not. The poor girl has fallen in love with the Gentleman Snarker, or the Unlucky Everydude secretly courts the daughter of the richest man in town. And she loves him too. Maybe it was Love at First Sight. Maybe she has a habit of slipping out to the seedier side of town for a night of fun. Maybe they've been friends their whole lives and the difference in status never really mattered. Will their love be enough to let them be happy together?" }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/SerialRomeo" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "This character is a hopeless romantic. He's madly, passionately, fatally devoted to the girl he loves. It's just that the girl he loves seems to change from week to week. When one girl rejects him (which she usually does), he is heartbroken at first, but he soon finds a new love interest, and forgets all about the old one.\nUnlike The Casanova, who strings many women along at the same time without caring about any of them, the Serial Romeo genuinely believes that each successive love is \"The One\", and that without her, life is not worth living. Expect this character to be completely blind to the implications of having a new \"True Love\" every week. If called out on his fickleness, expect him to insist that his current love interest is the only person he has ever really loved, and to dismiss her predecessors as mere youthful infatuations. Expect much eye-rolling from his friends.\nNote: Although this trope usually applies to men, feel free to put female examples here as well.\nSee also Looking for Love in All the Wrong Places, Girl of the Week, and In Love with Love." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/PleaseSpareHimMyLiege" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "This is when you beg the monarch, or whoever is in charge, to spare the life of someone set to be executed or given A Fate Worse Than Death.\nAs shown in the picture, it's best done kneeling while grasping the ermine robes in a reverent manner (kissing them optional). Often it's done by insisting you know this leader is magnanimous enough to do this.\nBut it's usually more successful if done in the form of ego stroking (\"Surely such a great king as yourself is wise enough...\", \"How could he possibly pose a threat to someone so great...?\") or noting the good PR it will bring (\"Everyone would know what a kind sovereign you are...\") than by trying to appeal to any good nature (\"If you just listen to your heart...\"). Even if they agree, the prisoner may just be tossed into The Alcatraz instead (Iron Mask optional).\nCompare/Contrast If You Kill Him, You Will Be Just Like Him." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/MadwomanInTheAttic" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "This is when a character with mental problems, and often some physical deformity, is locked away because s/he will never fit into society, usually either in the attic or in the basement, and often by a Corrupt Hick. The more of a Big Fancy House, the better; in fact, the smarter ones will sometimes have a secret system of peepholes and secret passages so they can move around as they please. They also tend to be inbred.\nThere are two basic plotlines for this type of character:\n The protagonist is an outsider, wondering what kind of bizarre secret the Corrupt Hicks are keeping. The Bertha will then either tend to be Dragon-type enemies with little personality of their own, or they're The Grotesque, sympathetic victims. When done well, this can be an effective scare because it so aptly encapsulates the frightening insularity of the Town with a Dark Secret.\n The main characters have just moved into a new house, and unbeknownst to them, are being watched by one of these whose caretakers have died some time ago. These are scary because of how they personify the fears of buying a new house: that your house has some hideous aspect that you haven't seen, but can see you.\nThis trope is named for the landmark work of feminist literary criticism by Sandra Gilbert and Susan Gubar, referring to Mr. Rochester's wife in Charlotte Brontë's Jane Eyre. The analysis indicates that this trope first popularly appeared, in all places, in Victorian women's literature, where depicting some women as crazy people was an easy way to make female villains with whom readers would be unlikely to sympathize. Obviously, this plan was not a complete success.\nSubversions occasionally arise when it turns out that there was a very good reason this person was locked away in the first place. Maybe they're Axe Crazy, maybe they suffer from an extremely contagious form of illness, or perhaps the person is being hidden for their own safety to keep them from being kidnapped or murdered.\nUsually either Ax-Crazy or The Grotesque. Compare Man in the Iron Mask.\nNot to be confused with the company involved with the first season of Smash." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/MissedHimByThatMuch" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "Two characters are wandering around a busy and/or crowded location such as a large business office, and they continuously and unintentionally just manage to keep missing seeing each other, turning corners, ducking down into cubicles to peer at intriguing computer screens, and so forth.\nVariables:\n The two may or may not be actively looking for each other\n The act of seeing would either be very good for both of the duo, or very bad for one of them.\n The sequence sometimes ends with them never meeting, but usually they finally (finally) collide at the absolute best/worst/funniest moment.\nUsually played for laughs, but can be used in an attempt to build suspense. Also used to execute and maintain a Not-So-Imaginary Friend. In any event, as some of the examples below will indicate, it is a schtick that is very very easy for a plot-creator to painfully over-do. For works with contemporary, real-world settings, this trope may soon fall victim to the prevalence of cell phones and wind up discredited.\nA somewhat more realistic variation on Scooby-Dooby Doors. For the time-travel variant, see Never the Selves Shall Meet. See also Hidden in Plain Sight, Gave Up Too Soon. See Close-Call Haircut for the attack version.\nThe trope's name is a riff on one of Maxwell Smart's many catch phrases, but he never actually engaged in it himself." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/NoManShouldHaveThisPower" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "With Great Power Comes Great Responsibility, but Power Corrupts, and absolute power corrupts absolutely. Some powers — and responsibilities — are too great for anyone to be trusted with.\nA character may realize this on his own — perhaps the Big Bad has just been defeated, and his Ancient Artifact is now in The Hero's control. After contemplating all the good he could do, The Hero may realize that he can't take away people's free will. He may experience a \"We're Not So Different\" moment, and gain some sympathy for his enemy.\nAlternatively, the party may begin fighting over who should control this power, demonstrating their inability to be trusted with it. Eventually, a wiser member will point out that the only possible solution is for no one to have it.\nIn any case, the choice will usually be clear. The source of power must be discarded, destroyed, or sealed back in its tin. This may be a final resolution, a return to the status quo, or even the beginning of a quest to get rid of the power. If the proper choice isn't made, this may mark the Start of Darkness.\nSee No MacGuffin, No Winner when the power is lost as a karmic punishment, rather than a willing decision in fear of the consequences. Also compare It Belongs in a Museum. Does not refer to powers that only women have, or only The Chosen One or many should have.\nSee also: The World Is Not Ready, Status Quo Is God, and Reluctant Mad Scientist. If the power simply isn't used, for no specific reason, that's Holding Back the Phlebotinum." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/LoveGoddess" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "This character is regarded as a deity of love (which, more often than not, includes sexual lust as well). Most likely a member of the setting's ruling pantheon, but could be any character (including a mortal) who is regarded by other characters as a goddess of love. Male love gods are included in this trope. It is called \"Love Goddess\" rather than \"Love Deity\" because the females are much more common.\nThe Matchmaker is her God Job; her role in any given plot is most likely to put characters into a relationship. Thus, she is a walking defiance of tropes such as Will They or Won't They? and Twice Shy. Naturally, this does not preclude a Match Maker Crush.\nAs a character, she/he is likely to be an Ethical Slut, Good Bad Girl, Hot God, Sex God, or all of the above. If she is like Cupid, then she will have archery skills.\nHistorical Domain Characters like Aphrodite and Freyja count as separate examples when they appear as characters in separate works of fiction. For example, Hercules: The Legendary Journeys and Xena: Warrior Princess count, since Aphrodite is a character in some episodes, while Order of the Stick so far does not count: Freyja is a part of the northern pantheon, but unlike Thor, she has so far never really been part of the plot. note Aphrodite, on the other hand, has made a cameo appearance, but that's just it: a cameo appearance in which she and her entire pantheon were unpersoned.\nContrast War God, this trope's polar opposite. Mythology and media in general tend to pair these two up regardless.\nStrictly speaking in terms of historical cultural significance, gods of love were often considered one of the most powerful members of the pantheon. God of love does not just cover romantic love; it covers all types of love, including love for violence, war and alcohol (hence why Aphrodite wandered about the battlefield at Troy), and the obsessive kinds that make you stupid, evil or crazy. This makes them gods you never, ever want to cross." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/WringEveryLastDropOutOfHim" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "You know how some character has been sick for ages and ages and ages, and how his death will be dragged out for days/weeks/months/years, until by the time it finally happens, people are no longer shocked, or no longer even care?\nYeah. This is Kill Him Already on a slow, unheroic scale, Ill Girl taken to the ultimate conclusion. It's Almost Dead Guy for a longer duration, with less usefulness. Generally manifests in some kind of Soap Opera Disease. Probably has something to do with Death Is Dramatic, or Creator Breakdown or Downer Ending." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/CoolUncle" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "Lots of fictional families seem to have that one uncle that all the kids just love. Most often, he's a young bachelor who has no intention of settling down any time soon, though he may have a girlfriend. He may travel a lot and wow the kids with stories of meeting celebrities and traveling the world (and if so, he always brings back the coolest souvenirs, which he naturally gives away as presents). Or he may be well-off and spoils his sibling's kids whenever they're together.\nRegardless, he will often be secretly be envious of the stability and loving home life that his brother or sister enjoys, even as he boasts of his own independence. The uncle may be the Black Sheep of the family. If his nieces and nephews ever lose their parent, he's the one who usually steps in to become a Parental Substitute.\nThis trope is usually male, but the role will occasionally be taken on by an aunt.\nContrast Evil Uncle and Creepy Uncle." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/JustHitHim" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "The Hero is fighting against the Giant Mook. He might be slow, but he sure is strong — he doesn't seem to even notice the hero's blows. The hero can hold him off for a while, but before too long, the mook has knocked away his weapon and taken hold of him. With this enemy's strength, this is surely the end for our hero. He'll just snap the hero like a twig, crush the life out of him, or hold him still with one hand and punch his head right off his shoulders...\nOh, no, he's thrown the hero across the room. I'm sure it hurt, but the hero is getting up again. Now he's very slowly closing the distance... He's got the hero again; now it's time for the killing blow. Just twist his head off like a bottle cap....\nNope, he's just holding the hero up in the air by the throat. Oh, and now the hero has kicked him in the groin. You'd think the mook would have seen that coming. However, unfazed, he...\n...he's thrown the hero again — right through a wall, so he must have thrown him pretty hard. However, the hero is now conveniently right next to the weapon he dropped earlier, giving him another chance to fight back. This could have been avoided if the mook would have Just Hit Him!\nAlso popular with superpowered villains with telekinetic powers. Despite the availability of superior attacks, they always try to lift the hero up in the air and toss him gently.\nA Doylist explanation for this phenomenon is that many writers are not martial artists. While the Gracies demonstrated the power of Brazilian jui-jitsu over many striking styles in the early days of the UFC, grappling and wrestling are still widely underestimated by the public, who don't recognize the damage a good slam or throw can do.\nThe other Doylist explanation arises when the mook is specifically superstrong. Any superstrong character who gets his hands on a normal human just needs to squeeze. The human will then be dead (or crippled and in agonizing pain, depending on the part that got squeezed). This would end the fight fast and permanently, and that is sometimes exactly what the story doesn't need.\nSee Why Don't Ya Just Shoot Him? for relevant Stock Phrases. Compare Bond Villain Stupidity. Contrast Wrestler in All of Us, particularly its subtropes Meteor Move, Spinning Piledriver and Suplex Finisher, where throws are genuinely dangerous.\n\nExamples" }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/HotGod" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "When the gods are divine in their beauty as well as power, they've earned the right to be called a Hot God.\nInvariably, a Love Goddess is always a Hot God. Note also that several goddesses (from a multitude of pantheons) were seen as befitting of the Lady of War/Amazonian Beauty archetypes, so it seems divine power may be telling of how attractive power is.\nOf course, gods are supposed to be models that concepts are based on, so whatever concept they represent is one that they have, a thousand times more than any mortal could. So it would be a no-brainer that a goddess of love - or beauty, fertility, marriage, or pretty much any concept related to human interaction - would have unearthly beauty.\nSee the related Angelic Beauty for the divinely beautiful on the lower end of the cosmic totem pole. Consequently, see Horny Devils and Hot as Hell for a Hot God's infernal rivals in looks.\nNot to be confused with something that you put jelly on... except in very specific fantasies.\n\nExamples" }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/IfYouTauntHimYouWillBeJustLikeHim" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "When an evil character is in the same vicinity as a good character, usually something devious is going on. Sometimes, though, the villain just doesn't want to fight. Maybe they just finished a hero/villain teamup. Maybe they're in a neutral zone, and they can't be overtly hostile. Or maybe the evil one is just Genre Savvy enough to realize that sometimes the best way to hit somebody is to trick them into crawling down to evil's level.\nThis trope is what happens when a villain starts annoying the hero as much as possible without actually giving them any clear cause to resort to violence. Once placed in this situation, the hero has two options. First, give in. After that, punishment is inevitable. Whenever an evil character manages to provoke a good character in this manner, the good one always ends up getting punished. This is almost always what the evil character intended by being such a pest in the first place.\nThe second choice, and always the one taken by especially noble heroes who make it a point to be Lawful Good, is to walk away and not dignify the evil ones with the satisfaction of manipulating a good guy.\nNaturally, this trope can tend to be a pretty heavy Broken Aesop- the Naïve Everygirl must forgive and understand and offer her friendship to the Alpha Bitch no matter how badly and rudely and unfairly she's treated... but don't expect anybody to cut you a break, ever. The number of times main characters must learn to accept jerks and devils in plain sight because \"it's the right thing to do\" is exactly proportionate to the number of times they can't get away with similar infractions.\nThis trope stems from the fact that the main character Can't Get Away with Nuthin' . When anyone can taunt anyone else, but the main character is evil for doing so, it's Selective Enforcement.\nA character's response to this trope is a good way of determining where they fall on the Sliding Scale of Idealism Versus Cynicism. See If You Kill Him, You Will Be Just Like Him for this trope as it applies to a Matter of Life and Death.\nSee I Shall Taunt You when this scheme is employed deliberately as a part of a larger plan, usually a Batman Gambit." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/WhatHeSaid" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "A Stock Phrase used in comedic situations. One person will speak at length, often intelligently and involving either an excellent explanation of what's going on and why, or a highly practical solution to the current problem. Other characters, upon being consulted, will reply with \"What He Said\".\nThis is especially true when the one speaking is a temporary or new authority figure, and the one saying 'what he said' is the previous one or a more well-known and respected authority, proving that the new guy does know what he's talking about.\nEspecially funny when the previous or 'true' authority figure demands to have the last say, and that he be recognized as the ultimate authority... and then simply repeats the ideas presented by the upstart, often with these same words.\nDoes not actually require Exposition on the part of the first speaker, only a statement agreed with by the second person with the words \"What he said\".\nVery common on internet forums, where Me Too is one of the archetypal Online Personas. This has, in turn, given rise to the acronym QFT, \"Quoted For Truth\".\nNot to be confused with \"That's What She Said\"." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/ObliviousToHisOwnDescription" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "Character comes across some kind of definition that the audience, or other characters, know to be right about him. The character is the only one who is unaware of that.\nUsually Played for Laughs. May come in a variety of ways:\n Someone tells something about an unspecified someone. The character asks, \"Who would be that?\" The reply is, \"That would be you.\"\n The character hears a word or expression for the first time and asks out loud what it means. Perhaps it is beyond the character's vocabulary, perhaps it comes from a Fictionary. Irony is, the character is a walking example of the word.\n There is a picture, drawing or wanted sign of the character. He fails to see himself in it.\nAn embarrassed or hypocritical character might act like this, while keeping quiet about knowing the description is accurate (\"I'm sure I don't know what you're talking about\"). A disguised character might pretend to be oblivious but compliment himself while at it.\nCompare Failed a Spot Check, I Resemble That Remark, Calling Me a Logarithm and \"Where?  Where?\"." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/LetHimChoose" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "Alice and Bob are disputing custody of a child or pet. The solution at which they arrive (or the one that is imposed on them by an authority figure, such as a judge, parent [if Alice and Bob are siblings], etc.) is to let the child or pet at issue choose which one he/she wants. Usually, the child or pet is placed in between Alice and Bob, and one of the characters (Bob) will try and talk it into coming with them, while the other will just stand there and wait. More often than not, the animal or child will have already made up its mind and go with Alice.\nSometimes, however, the big issue is not the people making someone make a choice, but the point that someone is being forced to make a very unpleasant choice- especially in a romance situation. These situations most often do not settle the issue, and have a high likelihood of the one making the choice being hurt. Badly.\nThe child/pet may sometimes Take a Third Option." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/IDidntMeanToKillHim" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "An alternative to the Motive Rant has the perp, when cornered, explain how the murder was all an accident. Their excuse can be almost anything, but the most common explanations are\n \"It was just a joke!\", when a prank or practical joke goes horribly wrong.\n They were having an argument with the victim and accidentally shoved/nudged/chased them over the precipice or down the stairs.\n \"I didn't mean to hit him that hard!\": They did mean to hit him, just a teensy bit, or some such thing.\n \"I only meant to make him sick...\", usually so that the victim would be unable to do something and the killer could step into the victim's place. It may be a competition, a presentation, or a trip. Or almost anything else.\n \"I didn't know it would harm him...\": They did not know the victim would have a life-threatening allergic reaction or had different biochemistry.\nAfter making the I Didnt Mean To Kill Him declaration, they'll often go on to explain that they dismembered the corpse and hid the pieces in a septic tank because they \"panicked\". In such a spiel, they will always, every time, utter the line \"I didn't mean to kill him/her\", as if that's supposed to make it all better.\nCompare to Accidental Murder, where the dead people are accidental collateral damage rather than dead by misaimed intention, and Murder by Mistake, where the killer was trying to kill someone else but got the wrong person." }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/WhatIsOneMansLifeInComparison" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "A character is expected to make some sort Heroic Sacrifice for the greater good, either Because Destiny Says So or Utopia Justifies the Means. The only problem is... nobody ever told him. When he disagrees with his apparent fate, whoever expects him to give up his life willingly expresses the sentiment of \"What is one man's life worth when weighed against the entire world?\" or something similar.\nDepending on the character, after being told this, he may or may not oblige.\nCompare A Million is a Statistic and What You Are in the Dark" }
      } ,
      {
        "trope": { "type": "uri" , "value": "http://dbtropes.org/resource/Main/ConvertedFanboy" } ,
        "comment": { "type": "literal" , "xml:lang": "en" , "value": "A character who starts out not being nerdy is persuaded to try something nerdy, and winds up liking it. Unisex Trope, since some of the examples are female—indeed, one of the most common forms portrayed is women watching sports with their significant others (to avoid becoming a Sports Widow) only to end up more fanatical than the boyfriend/husband/what have you.\nMay result in a character getting into other fandoms as well, since you can't like Star Wars without trying out other science fiction. This, in turn, may result in the character becoming Adorkable.\nCompare Hype Backlash and Hype Aversion should the attempts of conversion fail. Related to I Do Not Like Green Eggs and Ham." }
      }
    ]
  }
}
